Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/users_groups/contacting_users.po
Languages: pt

source: Contacting other users
pt: Contacto com outros usuários

source: GeoNode allows you to communicate by message with other registered users and groups.
pt: O GeoNode permite que você se comunique por mensagem com outros usuários e grupos registados.

source: To send a message to some user and/or groups you can follow the link :guilabel:`Message User` from your *Profile* page (see :ref:`editing-profile`) or from the *Profile* details page (see the previous section :ref:`user-info`) of that user.
pt: Para enviar uma mensagem para algum usuário e/ou grupos, você pode seguir o link :guilabel:`Message User` da sua página de *Perfil* (veja :ref:`editing-profile`) ou da página de detalhes de *Perfil* (veja a secção anterior :ref:`user-info`) desse usuário.

source: *Send message to users and groups*
pt: *Envie uma mensagem para usuários e grupos*

source: Insert your content, type a subject and click on :guilabel:`Send message` to send the message to the users and groups you have selected.
pt: Insira seu conteúdo, digite um assunto e clique em :guilabel:`Send message` para enviar a mensagem aos usuários e grupos que você seleccionou.

source: You will be redirected to the *Conversation* details page related to the subject.
pt: Você será redireccionado para a página de detalhes da *Conversa* relacionada ao assunto.

source: *Your message*
pt: *Sua mensagem*

source: The Inbox page
pt: A página da caixa de Entrada

source: You can view your conversations in your *Inbox* page, reachable through the :guilabel:`Back to inbox` button (see the picture above) or from the :guilabel:`Inbox` link of the user menu.
pt: Você pode ver suas conversas na página *Caixa de Entrada*, acessível através do botão :guilabel:`Back to inbox` (veja a imagem acima) ou do link :guilabel:`Inbox` do menu do usuário.

source: *Inbox link*
pt: *Link da caixa de entrada*

source: The picture below shows how your *Inbox* page should look like.
pt: A imagem abaixo mostra como deve ser a aparência da sua página *Caixa de Entrada*.

source: *Inbox page*
pt: *Página da caixa de entrada*

source: In *Inbox* all the unread messages are listed. You haven't received any message yet so your *Inbox* is empty. If you switch to the *All* tab you can see all the conversations you are involved in.
pt: Na *Caixa de entrada* todas as mensagens não lidas são listadas. Você ainda não recebeu nenhuma mensagem, então sua *Caixa de entrada* está vazia. Se você alternar para a guia *Todas*, poderá ver todas as conversas nas quais está envolvido.

source: *All your conversations*
pt: *Todas as suas conversas*

source: When some user send a reply to your message your *Inbox* shows it, see the picture below for an example.
pt: Quando algum usuário envia uma resposta à sua mensagem, sua *Caixa de Entrada* mostra-a, veja a imagem abaixo para um exemplo.

source: *A reply to your message*
pt: *Uma resposta à sua mensagem*

source: You can open the *Conversation* details by clicking on the *Subject* link.
pt: Você pode abrir os detalhes da *Conversa* clicando no link *Assunto*.

source: *Conversation details*
pt: *Detalhes da conversa*

source: As you can see in the picture above, in the *Conversation* page you have the ability to write a quick reply. Type your message in the text box and click on :guilabel:`Send Reply` to do that.
pt: Como você pode ver na imagem acima, na página *Conversa* você pode escrever uma resposta rápida. Digite sua mensagem na caixa de texto e clique em :guilabel:`Send Reply` para fazer isso.

source: In the *Inbox* page there is also the :guilabel:`Create Message` button that provides you a quick link to the message creation form.
pt: Na página *Caixa de Entrada* há também o botão :guilabel:`Create Message` que fornece um link rápido para o formulário de criação de mensagem.
