Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/users_groups/users_info.po
Languages: pt

source: Viewing other users information
pt: Visualização de informações de outros usuários

source: Once your account is created, you can view other accounts on the system.
pt: Uma vez que sua conta é criada, você pode ver outras contas no sistema.

source: To see information about other users on the system, click the :guilabel:`People` link of the :guilabel:`About` menu in *Home* page.
pt: Para ver informações sobre outros usuários no sistema, clique no link :guilabel:`People` do menu :guilabel:`About` na página *Home*.

source: *About menu - People link*
pt: *Menu About - link People*

source: You will see a list of users registered on the system.
pt: Você irá ver uma lista de usuários registados no sistema.

source: *List of the registered users*
pt: *Lista dos usuários registados*

source: The *Search* tool is very useful in case of many registered users, type the name of the user you are looking for in the input text field to filter the users list.
pt: A ferramenta *Pesquisar* é muito útil no caso de muitos usuários registados, digite o nome do usuário que você está à procura no campo de texto de entrada para filtrar a lista de usuários.

source: Select a user and click on its *username* to access to the user details page.
pt: Seleccione um usuário e clique em seu *nome de usuário* para acessar a página de detalhes do usuário.

source: *User details*
pt: *Detalhes do usuário*

source: Through the :guilabel:`User Activities` link, in right side of the page, it is possible to visualize all the activities the user has been done.
pt: Através do link :guilabel:`User Activities`, no lado direito da página, é possível visualizar todas as actividades realizadas pelo usuário.

source: *User activities*
pt: *Actividades do usuário*

source: The :guilabel:`Message User` link lets you to contact other users, see the next section to read more about that.
pt: O link :guilabel:`Message User` permite que você contacte outros usuários, consulte a próxima secção para ler mais sobre isso.

source: It is also possible, in GeoNode, to see the recent activities of all users through the :guilabel:`Recent Activities` link of the user menu.
pt: É também possível, no GeoNode, ver as actividades recentes de todos os usuários através do link :guilabel:`Recent Activities` do menu do usuário.

source: *Recent Activities link*
pt: *Link de Actividades Recentes*

source: In the picture below an example.
pt: Na foto abaixo um exemplo.

source: *Recent Activities*
pt: *Actividades Recentes*
