Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/index.po
Languages: pt

source: About
pt: Sobre

source: Getting Started
pt: Início

source: Using
pt: Utilização

source: Installing
pt: Instalação

source: Configuring (Basic)
pt: Configuração (Básico)

source: Configuring (Intermediate)
pt: Configuração (Intermediário)

source: Configuring (Advanced)
pt: Configuração (Avançado)

source: Administering
pt: Administração

source: Contributing
pt: Contribuição

source: Developing
pt: Em desenvolvimento

source: GeoNode's Documentation
pt: Documentação do GeoNode

source: Welcome to GeoNode's Documentation.
pt: Bem-vindo à documentação do GeoNode.

source: GeoNode is an Open Source, Content Management System (CMS) for geospatial data. It is a web-based application and platform for developing geospatial information systems (GIS) and for deploying spatial data infrastructures (SDI).
pt: GeoNode é um sistema de gestão de conteúdo (CMS) de código aberto para dados geoespaciais. É uma aplicação e plataforma baseada na web para o desenvolvimento de sistemas de informação geoespaciais (SIG) e para implantação de infraestruturas de dados espaciais (SDI).

source: Table of contents
pt: Índice
