Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/publishing_data/index.po
Languages: pt_pt

source: Publishing Data
pt_pt: Publicação de Dados

source: In GeoNode, each resource can be published in order to share it with other people. Once a *Map* has been published you can embed it in your web pages, your blog or your web site.
pt_pt: No GeoNode, cada recurso pode ser publicado de forma a ser compartilhado com outras pessoas. Assim que um *Mapa* for publicado, você poderá incorporá-lo às suas páginas da web, blog ou site da web.

source: An easy way to accomplish that is to use an ``iframe``. See the following steps:
pt_pt: Uma maneira fácil de conseguir isso é usar um ``iframe``. Veja as seguintes etapas:

source: Open the :ref:`map-info` page and copy the *URL*
pt_pt: Abra a página :ref:`informação-do-mapa` e copie o *URL*

source: *The Map Information Page URL*
pt_pt: *O URL da página de Informações do Mapa*

source: Add *"/embed"* to the URL so that it will be like this *"http://master.demo.geonode.org/maps/11/embed"*
pt_pt: Adicione *"/incorpore"* ao URL para que fique assim *"http://master.demo.geonode.org/maps/11/embed"*

source: Use this URL inside an html ``iframe`` as ``src`` value
pt_pt: Use este URL dentro de um ``iframe`` html como valor ``src``

source: Put this html block of code inside your web pages to display the map.
pt_pt: Coloque este bloco de código html dentro de suas páginas da web para exibir o mapa.

source: Saving an html file with this code you can test your map on your pc, look at the following picture.
pt_pt: Ao salvar um arquivo html com este código você pode testar seu mapa no seu pc, veja a figura a seguir.

source: *The Embedded Map*
pt_pt: *O Mapa Incorporado*

source: As you can see, some basic functionalities will be available to the user: the :ref:`toc`, the :ref:`basemap-switcher`, the :ref:`sidebar` and the :ref:`options-menu-tools`.
pt_pt: Como pode ver, algumas funcionalidades básicas estarão disponíveis para o usuário: o :ref:`toc`, o :ref:`comutador-do-mapa-base`, o :ref:`barra lateral` e o :ref:`ferramentas-do-menu-opções`.
