Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/about/index.po
Languages: pt_pt

source: What is GeoNode
pt_pt: O que é GeoNode

source: GeoNode is a geospatial content management system, a platform for the management and publication of geospatial data. It brings together mature and stable open-source software projects under a consistent and easy-to-use interface allowing non-specialized users to share data and create interactive maps.
pt_pt: GeoNode é um sistema de gestão de conteúdo geoespacial , uma plataforma para a gestão e publicação de dados geoespaciais. Reúne projetos de software de código aberto maduros e estáveis em uma interface consistente e fácil de usar, permitindo aos utilizadores não especializados partilhar dados e criar mapas interactivos.

source: Data management tools built into GeoNode allow for integrated creation of data, metadata, and map visualization. Each dataset in the system can be shared publicly or restricted to allow access to only specific users. Social features like user profiles and commenting and rating systems allow for the development of communities around each platform to facilitate the use, management, and quality control of the data the GeoNode instance contains.
pt_pt: As ferramentas de gestão de dados incorporadas no GeoNode permitem a criação integrada de dados, metadados e visualização de mapas. Cada conjunto de dados no sistema pode ser partilhado publicamente ou restringido para permitir o acesso a apenas utilizadores específicos. Funcionalidades sociais como perfis de utilizador e sistemas de comentários e classificação permitem o desenvolvimento de comunidades em cada plataforma para facilitar o uso, gestão e controlo de qualidade dos dados que a instância do GeoNode contém.

source: It is also designed to be a flexible platform that software developers can extend, modify or integrate against to meet requirements in their own applications.
pt_pt: É também projetado para ser uma plataforma flexível, que os desenvolvedores de software podem estender, modificar ou integrar para atender aos requisitos em seus próprios aplicativos.

source: Showcase
pt_pt: Mostruário

source: A handful of other Open Source projects extend GeoNode’s functionality by tapping into the re-usability of Django applications. Visit our gallery to see how the community uses GeoNode: `GeoNode Showcase <http://geonode.org/gallery/>`_.
pt_pt: Vários outros projetos de código aberto estendem a funcionalidade do GeoNode, aproveitando a capacidade de reutilização de aplicativos Django. Visite a nossa galeria para ver como a comunidade usa o GeoNode: `Mostruário GeoNode <http://geonode.org/gallery/>`_.

source: The development community is very supportive of new projects and contributes ideas and guidance for newcomers.
pt_pt: A comunidade de desenvolvimento dá muito apoio a novos projectos e contribui com ideias e orientações para os recém-chegados.

source: For a live demo see also :ref:`online_demo`
pt_pt: Para uma demonstração em tempo real, veja também :ref:`demonstração_online`

source: Most useful links
pt_pt: Links mais úteis

source: **General**
pt_pt: **Geral**

source: Project homepage: https://geonode.org
pt_pt: Página inicial do projecto: https://geonode.org

source: Repository: https://github.com/GeoNode/geonode
pt_pt: Repositório: https://github.com/GeoNode/geonode

source: Official Demo: http://master.demo.geonode.org
pt_pt: Demonstração oficial: http://master.demo.geonode.org

source: GeoNode Wiki: https://github.com/GeoNode/geonode/wiki
pt_pt: Wiki do GeoNode: https://github.com/GeoNode/geonode/wiki

source: Issue tracker: https://github.com/GeoNode/geonode-project/issues
pt_pt: Rastreador de problemas: https://github.com/GeoNode/geonode-project/issues

source: In case of sensitive bugs like security vulnerabilities, please contact a GeoNode Core Developer directly instead of using issue tracker. We value your effort to improve the security and privacy of this project!
pt_pt: No caso de bugs sensíveis como vulnerabilidades de segurança, por favor, entre em contacto com um Desenvolvedor Principal do GeoNode directamente, ao invés de usar o rastreador de problemas. Valorizamos seu esforço para melhorar a segurança e a privacidade deste projecto!

source: **Related projects**
pt_pt: **Projectos relacionados**

source: GeoNode Project: https://github.com/GeoNode/geonode-project
pt_pt: Projecto GeoNode: https://github.com/GeoNode/geonode-project

source: GeoNode at Docker: https://hub.docker.com/u/geonode
pt_pt: GeoNode no Docker: https://hub.docker.com/u/geonode

source: GeoNode OSGeo-Live: https://live.osgeo.org/en/
pt_pt: OSGeo-Live GeoNode: https://live.osgeo.org/en/

source: Licensing
pt_pt: Licenciamento

source: GeoNode is Copyright 2018 Open Source Geospatial Foundation (OSGeo).
pt_pt: GeoNode é Copyright 2018 Open Source Geospatial Foundation (OSGeo).

source: GeoNode is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. GeoNode is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
pt_pt: GeoNode é um software gratuíto: você pode redistribuí-lo e/u modificá-lo sob os termos da GNU General Public License (Licença Pública Geral GNU) conforme publicado pela Free Software Foundation, seja a versão 3 da Licença, ou (por sua opção) qualquer versão posterior. O GeoNode é distribuído na esperança de que seja útil, mas SEM NENHUMA GARANTIA; sem mesmo a garantia implícita de COMERCIALIDADE ou ADEQUABILIDADE A UM DETERMINADO FIM. Consulte a Licença Pública Geral GNU para obter mais detalhes.

source: You should have received a copy of the GNU General Public License along with GeoNode. If not, see http://www.gnu.org/licenses.
pt_pt: Você deveria ter recebido uma cópia da Licença Pública Geral GNU junto com o GeoNode. Caso contrário, consulte http://www.gnu.org/licenses.

source: Current Version and Features
pt_pt: Versão actual e recursos

source: GeoNode current version: `3.2.0 <https://github.com/GeoNode/geonode/releases/tag/3.2.0>`_
pt_pt: Versão actual do GeoNode: `3.2.0 <https://github.com/GeoNode/geonode/releases/tag/3.2.0>` _

source: Main Features: `State of GeoNode <https://www.dropbox.com/s/r7ftt38mleadzo6/State%20of%20GeoNode%203.2.0%20-%20v1.2.pdf?dl=1>`_
pt_pt: Principais Recursos: `Estado do GeoNode <https://www.dropbox.com/s/r7ftt38mleadzo6/State%20of%20GeoNode%203.2.0%20-%20v1.2.pdf?dl=1>`_

source: Get in touch with the community
pt_pt: Entre em contacto com a comunidade

source: GeoNode is an open source project and contributors are needed to keep this project moving forward. Learn more on how to contribute on our `Community Bylaws <https://github.com/GeoNode/geonode/wiki/Community-Bylaws>`_.
pt_pt: GeoNode é um projecto de código aberto e colaboradores são necessários para manter este projecto em andamento. Saiba mais sobre como contribuir, no nosso `Estatuto da Comunidade <https://github.com/GeoNode/geonode/wiki/Community-Bylaws>`_.

source: User Mailing List: https://lists.osgeo.org/cgi-bin/mailman/listinfo/geonode-users
pt_pt: Lista de Distribuição de Usuário: https://lists.osgeo.org/cgi-bin/mailman/listinfo/geonode-users

source: Developer Mailing List: https://lists.osgeo.org/cgi-bin/mailman/listinfo/geonode-devel
pt_pt: Lista de Distribuição de Desenvolvedor: https://lists.osgeo.org/cgi-bin/mailman/listinfo/geonode-devel

source: Gitter Chat: https://gitter.im/GeoNode/general
pt_pt: Chat do Gitter: https://gitter.im/GeoNode/general

source: Roadmap
pt_pt: Roteiro

source: GeoNode's development roadmap is documented in a series of GeoNode Improvement Projects (GNIPS). They are documented at `GeoNode Wiki <https://github.com/GeoNode/geonode/wiki/GeoNode-Improvement-Proposals>`_.
pt_pt: O roteiro de desenvolvimento do GeoNode está documentado em uma série de Projectos de Melhoria GeoNode (GNIPS). Eles estão documentados no `Wiki do GeoNode <https://github.com/GeoNode/geonode/wiki/GeoNode-Improvement-Proposals>`_.

source: GNIPS are considered to be large undertakings which will add a large amount of features to the project. As such they are the topic of community discussion and guidance.
pt_pt: GNIPS são considerados grandes empreendimentos que irão adicionar uma grande quantidade de recursos ao projeto. Como tal, são o tópico de discussão e orientação da comunidade.

source: The community discusses these on the developer mailing list: http://lists.osgeo.org/pipermail/geonode-devel/
pt_pt: A comunidade discute isso na lista de discussão do desenvolvedor: http://lists.osgeo.org/pipermail/geonode-devel/
