Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/data/data_types.po
Languages: pt_pt

source: Data Types
pt_pt: Tipos de Dados

source: GeoNode welcome page shows a variety of information about the current GeoNode instance.
pt_pt: A página de boas-vindas do GeoNode mostra uma variedade de informações sobre a instância actual do GeoNode.

source: You can explore the existing data using many search tools and filters (see :ref:`finding-data`) or through the links of the navigation bar at the top of the page.
pt_pt: Você pode explorar os dados existentes usando muitas ferramentas de pesquisa e filtros (veja :ref:`pesquisando-dados`) ou através dos links da barra de navegação no topo da página.

source: There are three main types of resources that GeoNode can manage:
pt_pt: Existem três tipos principais de recursos que o GeoNode pode fazer a gestão:

source: Documents
pt_pt: Documentos

source: Layers
pt_pt: Camadas

source: Maps
pt_pt: Mapas

source: Documents and layers can be accessed from the :guilabel:`Data` menu of the navigation bar.
pt_pt: Documentos e camadas podem ser acessados a partir do menu :guilabel:`Dados` da barra de navegação.

source: *Data menu*
pt_pt: *Menu de dados*

source: The :guilabel:`Maps` menu let you to manage maps.
pt_pt: O menu :guilabel:`Mapas` permite que você faça a gestão dos mapas.

source: *Maps menu*
pt_pt: *Menu de mapas*

source: GeoNode allows to publish tabular and text data and to manage metadata and associated documents.
pt_pt: GeoNode permite publicar dados tabulares e de texto e fazer a gestão de metadados e documentos associados.

source: Documents can be uploaded directly from your disk (see :ref:`uploading-documents` for further information).
pt_pt: Documentos podem ser carregados directamente do seu disco (veja :ref:`carregando-documentos` para mais informações).

source: The following documents types are allowed: `.doc, .docx, .gif, .jpg, .jpeg, .ods, .odt, .odp, .pdf, .png, .ppt, .pptx, .rar, .sld, .tif, .tiff, .txt, .xls, .xlsx, .xml, .zip, .gz, .qml`.
pt_pt: Os seguintes tipos de documentos são permitidos: `.doc, .docx, .gif, .jpg, .jpeg, .ods, .odt, .odp, .pdf, .png, .ppt, .pptx, .rar, .sld, .tif, .tiff, .txt, .xls, .xlsx, .xml, .zip, .gz, .qml`.

source: Through the document detailed page is possible to view, download and manage a document.
pt_pt: Através da página detalhada do documento é possível visualizar, baixar e gerir um documento.

source: Layers are a primary component of GeoNode.
pt_pt: As camadas são um componente principal do GeoNode.

source: Layers are publishable resources representing a raster or vector spatial data source. Layers also can be associated with metadata, ratings, and comments.
pt_pt: Camadas são recursos publicáveis que representam uma fonte de dados espaciais raster ou vectoriais. As camadas podem também ser associadas a metadados, classificações e comentários.

source: By clicking the Layers link you will get a list of all published layers. If logged in as an administrator, you will also see the unpublished layers in the same list.
pt_pt: Ao clicar no link Camadas, você obterá uma lista de todas as camadas publicadas. Se estiver conectado como administrador, você poderá também, ver as camadas não publicadas na mesma lista.

source: GeoNode allows the user to upload vector and raster data in their original projections using a web form.
pt_pt: GeoNode permite ao utilizador fazer upload de dados vectoriais e raster em suas projecções originais usando um formulário da web.

source: Vector data can be uploaded in many different formats (ESRI Shapefile, KML and so on...). Satellite imagery and other kinds of raster data can be uploaded as GeoTIFFs.
pt_pt: Os dados vectoriais podem ser enviados em muitos formatos diferentes (ESRI Shapefile, KML e assim por diante...). Imagens de satélite e outros tipos de dados raster podem ser carregados como GeoTIFFs.

source: Maps are a primary component of GeoNode.
pt_pt: Os mapas são um componente principal do GeoNode.

source: Maps are comprised of various layers and their styles. Layers can be both local layers in GeoNode as well as remote layers either served from other WMS servers or by web service layers such as Google or MapQuest.
pt_pt: Os mapas são compostos por várias camadas e seus estilos. As camadas podem ser tanto camadas locais no GeoNode quanto camadas remotas, servidas por outros servidores WMS ou por camadas de serviço da web, como Google ou MapQuest.

source: GeoNode maps also contain other information such as map zoom and extent, layer ordering, and style.
pt_pt: Os mapas GeoNode também contêm outras informações, como zoom e extensão do mapa, ordenação de camadas e estilo.

source: You can create a map based on uploaded layers, combine them with some existing layers and a remote web service layer, share the resulting map for public viewing. Once the data has been uploaded, GeoNode lets the user search for it geographically or via keywords and create maps. All the layers are automatically reprojected to web mercator for maps display, making it possible to use popular base maps such as `OpenStreetMap <https://www.openstreetmap.org>`_.
pt_pt: Você pode criar um mapa baseado em camadas carregadas, combiná-las com algumas camadas existentes e uma camada de serviço remoto da web, compartilhar o mapa resultante para exibição pública. Uma vez que os dados tenham sido carregados, o GeoNode permite que o usuário os procure geograficamente ou por meio de palavras-chave e crie mapas. Todas as camadas são reprojectadas automaticamente para o web mercator para exibição de mapas, tornando possível o uso de mapas básicos populares como o `OpenStreetMap <https://www.openstreetmap.org>`_.
