Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/data/finding_data.po
Languages: pt_pt

source: Finding Data
pt_pt: Encontrando Dados

source: This section will guide you to navigate GeoNode to find layers, maps and documents by using different routes, filters and search functions.
pt_pt: Esta secção irá guiá-lo para navegar o GeoNode para encontrar camadas, mapas e documentos usando diferentes rotas, filtros e funções de pesquisa.

source: In *Home* page you can find some quick search tool.
pt_pt: Na página *Home* poderá encontrar algumas ferramentas de busca rápida.

source: The *Search* box in the navigation bar (see the picture below) let you type a text and find all the data which have to deal with that text.
pt_pt: A caixa *Pesquisar* na barra de navegação (veja a imagem abaixo) permite que digite um texto e encontre todos os dados que têm que lidar com aquele texto.

source: *Search tool in GeoNode welcome page*
pt_pt: *Ferramenta de pesquisa na página de boas-vindas do GeoNode*

source: When you trigger a search you are brought to the *Search* page which shows you the search result through all data types.
pt_pt: Ao iniciar uma pesquisa, você é levado à página *Pesquisar*, que mostra o resultado da pesquisa em todos os tipos de dados.

source: *The Search page*
pt_pt: *A página de Pesquisa*

source: This page contains a wealth of options for customizing a search for various information on GeoNode. This search form allows for much more fine-tuned searches than the simple search box is available at the top of every page.
pt_pt: Esta página contém uma variedade de opções para personalizar uma busca por várias informações no GeoNode. Este formulário de pesquisa permite pesquisas muito mais ajustadas do que a simples caixa de pesquisa disponível no topo de cada página.

source: It is possible to search for data by Text, Categories, Type, Keywords, Owners, Date, Regions or Extent.
pt_pt: É possível pesquisar dados por Texto, Categorias, Tipo, Palavras-chave, Proprietários, Data, Regiões ou Extensão.

source: Try to set some filter and see how the resulting data list changes accordingly. An interesting type of filter is *EXTENT*: you can apply a spatial filter by moving or zooming a map within a box as shown in the picture below.
pt_pt: Tente definir algum filtro e ver como a lista de dados resultante muda de acordo. Um tipo interessante de filtro é *EXTENSÃO*: você pode aplicar um filtro espacial movendo ou ampliando um mapa dentro de uma caixa, conforme mostrado na imagem abaixo.

source: *Search filter by EXTENT*
pt_pt: *Filtro de pesquisa por EXTENSÃO*

source: Data can be ordered by date, name and popularity.
pt_pt: Os dados podem ser ordenados por data, nome e popularidade.

source: *Ordering Data*
pt_pt: *Ordenando Dados*

source: The GeoNode welcome page offers you many other options to find resources.
pt_pt: A página de boas-vindas do GeoNode oferece muitas outras opções para encontrar recursos.

source: The *Search for data* tool allows you to search for data by name.
pt_pt: A ferramenta *Search for data* permite pesquisar dados por nome.

source: *Searching for data*
pt_pt: *Pesquisando dados*

source: The *Search* page, which you will be redirected to, will have the TEXT filter already set with the name you have typed in the search box (see the picture below). If you want to reach the *Search page* directly, without any input text, you can click the :guilabel:`Advanced Search` link.
pt_pt: A página *Search*, para a qual você será redireccionado, já terá o filtro de TEXTO configurado com o nome que você digitou na caixa de busca (veja a imagem abaixo). Se você deseja acessar a *Página de pesquisa* directamente, sem qualquer entrada de texto, você pode clicar no link :guilabel:`Advanced Search`.

source: *Results of searching made by name*
pt_pt: *Resultados da pesquisa feita por nome*

source: In the *Home* page section shown below are listed all the categories available in the GeoNode instance you are using. You can search for data by category by clicking on it.
pt_pt: Na secção da página *Home* mostrada abaixo, estão listadas todas as categorias disponíveis na instância GeoNode que você está a usar. Você pode pesquisar dados por categoria clicando nela.

source: *Searching for datasets by category*
pt_pt: *Pesquisando conjuntos de dados por categoria*

source: In the *Search* page, data will be filtered by that category.
pt_pt: Na página *Pesquisar*, os dados serão filtrados por essa categoria.

source: *Results of searching made by category*
pt_pt: *Resultados da pesquisa feita por categoria*

source: The *Featured Datasets* section (see the picture below) shows you aggregate data about *Layers*, *Maps*, *Documents* and *Users*. You can trigger a search on layers by clicking on the *Layers* icon, the same happens for *Maps*, *Documents* and *Users*. The :guilabel:`Explore all datasets` drive you to the *Search* page with no filter on data types.
pt_pt: A secção *Featured Datasets* (veja a imagem abaixo) mostra dados agregados sobre *Camadas*, *Mapas*, *Documentos* e *Usuários*. Você pode accionar uma busca por camadas clicando no ícone *Layers*, o mesmo acontece para *Mapas*, *Documentos* e *Usuários*. O :guilabel:`Explore all datasets` o leva para a página *Pesquisar* sem filtro nos tipos de dados.

source: In this section there are also useful quick links to add new resources: the :guilabel:`Add layers` drives you to the layer uploading page, the :guilabel:`Add documents` to the document uploading page and the :guilabel:`Create maps` guide you to the map creation.
pt_pt: Nesta secção, também, há links rápidos úteis para adicionar novos recursos: o :guilabel:`Add layers` o leva para a página de envio de camadas, o :guilabel:`Add documents` para a página de envio de documentos e o :guilabel:`Create maps` o guiam à criação do mapa.

source: *Featured Datasets*
pt_pt: *Conjuntos de Dados em Destaque*

source: For each data type GeoNode makes available an individual *Search* page, the next paragraphs will explain that in depth. For *Users* see :ref:`user-info`.
pt_pt: Para cada tipo de dados, o GeoNode disponibiliza uma página de *Pesquisa* individual, os próximos parágrafos irão explicar isso em profundidade. Para *Usuários* veja :ref:`user-info`.

source: Documents
pt_pt: Documentos

source: When you are searching for *Documents* you can:
pt_pt: Ao pesquisar por *Documentos*, você pode:

source: use the *Documents* quick link of the *Featured Datasets* section as described above
pt_pt: usar o link rápido de *Documentos* da secção *Featured Datasets* conforme descrito acima

source: click on the :guilabel:`Documents` link of the :guilabel:`Data` menu in the navigation bar
pt_pt: clicar no link :guilabel:`Documents` do menu :guilabel:`Data` na barra de navegação

source: *Link for Documents*
pt_pt: *Link para Documentos*

source: The *Documents* search page looks like the generic one but only *Document* is considered as data type. You can filter documents by CATEGORIES, as in the example below, or by TEXT, KEYWORDS and so on. You can also use more than one filter at the same time.
pt_pt: A página de pesquisa *Documentos* parece genérica, mas apenas *Documento* é considerado um tipo de dados. Você pode filtrar documentos por CATEGORIAS, como no exemplo abaixo, ou por TEXTO, PALAVRAS-CHAVE e assim por diante. Você também pode usar mais de um filtro ao mesmo tempo.

source: *Documents filtered by categories*
pt_pt: *Documentos filtrados por categorias*

source: Layers
pt_pt: Camadas

source: To find *Layers* you can:
pt_pt: Para encontrar *Camadas*, você pode:

source: use the *Layers* quick link of the *Featured Datasets*
pt_pt: use o link rápido *Camadas* dos *Featured Datasets*

source: click on the :guilabel:`Layers` link of the :guilabel:`Data` menu in the navigation bar
pt_pt: clique no link :guilabel:`Layers` do menu :guilabel:`Data` na barra de navegação

source: *Link for Layers*
pt_pt: *Link para Camadas*

source: In the *Layers* search page only *Layer* will be considered as data type. You can set one or more filter to refine the search. In the example below the layers have been filtered by EXTENT and CATEGORIES.
pt_pt: Na página de pesquisa *Layers*, apenas *Camada* será considerado como tipo de dado. Você pode definir um ou mais filtros para refinar a pesquisa. No exemplo abaixo, as camadas foram filtradas por EXTENSÃO e CATEGORIAS.

source: *Layers filtered by extent*
pt_pt: *Camadas filtradas por extensão*

source: Maps
pt_pt: Mapas

source: If you are searching for *Maps* you can:
pt_pt: Se você estiver procurando por *Mapas*, poderá:

source: use the *Maps* quick link of the *Featured Datasets* section as described above
pt_pt: usar o link rápido *Mapas* da secção *Featured Datasets* conforme descrito acima

source: click on the :guilabel:`Explore Maps` link of the :guilabel:`Maps` menu in the navigation bar
pt_pt: clicar no link :guilabel:`Explore Maps` do menu :guilabel:`Maps` na barra de navegação

source: *Link for Maps*
pt_pt: *Link para Mapas*

source: As seen for the other data types, the *Maps* search page allows you to filter your maps by a combination of criteria. The example below shows maps filtered by REGIONS.
pt_pt: Como visto para os outros tipos de dados, a página de pesquisa *Mapas* permite que você filtre seus mapas por uma combinação de critérios. O exemplo abaixo mostra mapas filtrados por REGIÕES.

source: *Maps filtered by regions*
pt_pt: *Mapas filtrados por regiões*
