Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/accounts_user_profile/updating_profile/index.po
Languages: pt_pt

source: Updating the Profile
pt_pt: Actualização do Perfil

source: Once having an account you can enrich your profile with useful information, you can also edit or delete the existing ones. You can connect the account with your social network, associate many e-mail addresses to it and manage many options such as preferences about notifications.
pt_pt: Depois de ter uma conta, você pode enriquecer o seu perfil com informações úteis, você pode também editar ou excluir as existentes. Você pode conectar a conta à sua rede social, associar muitos endereços de e-mail a ela e fazer a gestão de várias opções, como preferências sobre notificações.

source: You can update these information anytime from your *Profile* page, it is accessible from the user menu.
pt_pt: Você pode actualizar essas informações a qualquer momento na página de *Perfil*, que pode ser acessada a partir do menu do utilizador.

source: So, click on your user name in the top right of the screen. A drop-down list will show. Click on :guilabel:`Profile` to enter the *Profile* settings page.
pt_pt: Então, clique em seu nome de utilizador no canto superior direito da tela. Uma lista suspensa será exibida. Clique em :guilabel:`Profile` para entrar na página de configurações do *Perfil*.

source: *Link to your profile*
pt_pt: *Link para o seu perfil*

source: The *Profile* page looks like the one shown in the picture below.
pt_pt: A página de *Perfil* se parece com a mostrada na imagem abaixo.

source: *User profile page*
pt_pt: *Página de perfil do utilizador*

source: Your personal information are shown under the username. At the bottom of the page are listed all the resources associated to your *Profile*, you can decide to view only layers or maps or documents by clicking on the corresponding tab.
pt_pt: Suas informações pessoais são mostradas sob o nome de utilizador. Na parte inferior da página estão listados todos os recursos associados ao seu *Perfil*, você pode decidir visualizar apenas camadas ou mapas ou documentos clicando na aba correspondente.

source: Through the link ``User layers WMS GetCapabilities document`` you can retrieve an XML document with the list of the available layers.
pt_pt: Através do link ``User layers WMS GetCapabilities document`` é possível recuperar um documento XML com a lista das camadas disponíveis.

source: On the right side of the page there are many useful links to edit personal information, to upload and create layers or maps, to update your *Profile* settings and to get in touch with other GeoNode users.
pt_pt: No lado direito da página, há muitos links úteis para editar informações pessoais, fazer upload e criar camadas ou mapas, actualizar as suas configurações de *Perfil* e entrar em contacto com outros utilizadores GeoNode.

source: The :guilabel:`Favorites` link, also accessible from the user menu, drive you to the list of the resources marked as your favorites.
pt_pt: O link :guilabel:`Favorites`, também acessível a partir do menu do usuário, leva à lista de recursos marcados como seus favoritos.

source: *Favorites*
pt_pt: *Favoritos*

source: Click the :guilabel:`Delete from Favorites` button to remove the resource from the list.
pt_pt: Clique no botão :guilabel:`Delete from Favorites` para remover o recurso da lista.

source: The :guilabel:`My Activities` link allows to see all your recent activities on GeoNode such as layers uploading and maps creation.
pt_pt: O link :guilabel:`My Activities` permite ver todas as suas actividades recentes no GeoNode, como upload de camadas e criação de mapas.

source: *Recent activities*
pt_pt: *Actividades recentes*

source: This link is also available in the user menu.
pt_pt: Este link está também disponível no menu do utilizador.

source: All other links and their functionalities will be described in depth in the following sections.
pt_pt: Todos os outros links e suas funcionalidades serão descritos em detalhe nas secções seguintes.
