Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/document_permissions.po
Languages: pt_pt

source: Changing the Document Permissions
pt_pt: Alterando as Permissões do Documento

source: GeoNode encourages to publicly, share and make available for download information uploaded on the platform. By default, anyone can see and download a document. However, the document responsible can choose to limit access to the document to some contributors and/or groups.
pt_pt: GeoNode incentiva publicamente, compartilhar e disponibilizar para download as informações carregadas na plataforma. Por padrão, qualquer pessoa pode ver e baixar um documento. No entanto, o responsável pelo documento pode optar por limitar o acesso ao documento a alguns colaboradores e/ou grupos.

source: Through the button shown in the picture below it is possible to manage the document permissions.
pt_pt: Através do botão mostrado na figura abaixo é possível fazer a gestão das permissões do documento.

source: *The button to change permissions*
pt_pt: *O botão para alterar as permissões*

source: The :guilabel:`Change Document Permissions` button on the right side of the document page allows to set up who can:
pt_pt: O botão :guilabel:`Alterar Permissões do Documento` no lado direito da página do documento permite definir quem pode:

source: View the document;
pt_pt: Ver o documento;

source: Download it;
pt_pt: Baixá-lo;

source: Edit its metadata;
pt_pt: Editar os seus metadados;

source: Manage it (update, delete, change permissions, publish/unpublish).
pt_pt: Fazer a gestão (actualizar, excluir, alterar permissões, publicar/cancelar publicação).

source: See an example in the picture below.
pt_pt: Veja um exemplo na imagem abaixo.

source: *Changing the Document permissions*
pt_pt: *Alterando as Permissões do documento*

source: Usually that editing of metadata and the management of a document are in charge of the responsible of the document, i.e. the contributor who uploaded it and who has those permissions by default.
pt_pt: Normalmente, a edição de metadados e a gestão de um documento ficam a cargo do responsável pelo documento, ou seja, o colaborador que o carregou e quem tem essas permissões por defeito.

source: Once the permissions are set, click :guilabel:`Apply changes` to save them.
pt_pt: Depois de definir as permissões, clique em :guilabel:`Aplicar alterações` para salvá-las.
