Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/document_metadata.po
Languages: pt

source: Filling the Document Metadata
pt: Preenchendo os Metadados do Documento

source: Metadata contains all the information related to the document: they are its ID card. They provide essential information for its identification and its comprehension. Metadata also make the document more easily retrievable through search by other users.
pt: Os metadados contêm todas as informações relativas ao documento: são o seu cartão de identificação. Eles fornecem informações essenciais para sua identificação e compreensão. Os metadados também tornam o documento mais facilmente recuperável por meio de pesquisas por outros usuários.

source: Editing a document's metadata is done in three steps (*Basic Metadata*, *Location and Licenses*, *Optional Metadata*). The first two steps are mandatory (no documents will be published if the required information are not provided) whereas the last one is optional.
pt: A edição dos metadados de um documento é feita em três etapas (*Metadados Básicos*, *Localização e Licenças*, *Metadados Opcionais*). As duas primeiras etapas são obrigatórias (nenhum documento será publicado se as informações exigidas não forem fornecidas), enquanto a última é opcional.

source: On the **Basic Metadata** page, the essential information that has to be filled is:
pt: Na página **Metadados Básicos**, as informações essenciais que devem ser preenchidas são:

source: The *Title* of the document, which should be clear and understandable;
pt: O *Título* do documento, que deve ser claro e compreensível;

source: An *Abstract* on the document;
pt: Um *Resumo* no documento;

source: The *Creation/Publication/Revision* dates which define the time period that is covered by the document;
pt: As datas de *Criação/Publicação/Revisão* que definem o período de tempo coberto pelo documento;

source: The *Keywords*, which should be chosen within the available list. The contributor search for available keywords by clicking on the searching bar, or on the folder logo representing, or by entering the first letters of the desired word. Key-words should be relevant to the imported document;
pt: As *Palavras-chave*, que devem ser escolhidas dentro da lista disponível. O colaborador busca as palavras-chave disponíveis clicando na barra de busca, ou no logotipo da pasta que representa, ou digitando as primeiras letras da palavra desejada. As palavras-chave devem ser relevantes para o documento importado;

source: The *Category* in which the document belongs;
pt: A *Categoria* à qual o documento pertence;

source: The *Group* to which the document is linked.
pt: O *Grupo* ao qual o documento está vinculado.

source: *Document Basic Metadata*
pt: *Metadados Básicos do Documento*

source: Once all the fields are filled, click on the blue button :guilabel:`Next >>` in the bottom right corner of the page.
pt: Assim que todos os campos estiverem preenchidos, clique no botão azul :guilabel:`Next >>` no canto inferior direito da página.

source: On the **Location and Licenses** page, the following information should be filled:
pt: Na página **Local e Licenças**, as seguintes informações devem ser preenchidas:

source: The *Language* of the document;
pt: O *Idioma* do documento;

source: The *Regions*, which informs on the spatial extent covered by the document. Proposed extents cover the following scales: global, continental, regional, national;
pt: As *Regiões*, que informam sobre a extensão espacial coberta pelo documento. As extensões propostas cobrem as seguintes escalas: global, continental, regional, nacional;

source: The *Data Quality statement* (general explanation of the data producer's knowledge about the lineage of a dataset);
pt: A *Declaração de Qualidade de Dados* (explicação geral do conhecimento do produtor de dados sobre a linhagem de um conjunto de dados);

source: Potential *Restrictions* to sharing the document should be provided in the Restrictions box.
pt: Potenciais *Restrições* ao compartilhamento do documento devem ser fornecidas na caixa Restrições.

source: *Document Location and Licenses*
pt: *Localização do Documento e Licenças*

source: Click on the blue button :guilabel:`Next >>` to go ahead to the next step.
pt: Clique no botão azul :guilabel:`Next >>` para avançar para a próxima etapa.

source: On the **Optional Metadata** page, complementary information can be added:
pt: Na página **Metadados Opcionais**, informações complementares podem ser adicionadas:

source: The *Edition* to indicate the reference or the source of the document;
pt: A *Edição* para indicar a referência ou a fonte do documento;

source: The *Purpose* of the document and its objectives;
pt: O *Propósito* do documento e seus objectivos;

source: Any *Supplemental information* that can provide a better understanding of the uploaded document;
pt: Qualquer *Informação suplementar* que possa fornecer uma melhor compreensão do documento carregado;

source: The *Maintenance frequency* of the document;
pt: A *Frequência de manutenção* do documento;

source: The *Spatial representation type* used.
pt: O *Tipo de representação espacial* usado.

source: *Document Optional Metadata*
pt: *Metadados Opcionais do Documento*

source: If all the mandatory information is filled out the document can be published, if not the ``Completeness`` progress bar warns you that something is missing.
pt: Se todas as informações obrigatórias forem preenchidas, o documento pode ser publicado, caso contrário a barra de progresso ``Completeness`` avisa que algo está faltando.

source: Click on the blue button :guilabel:`Update` to save information on the system.
pt: Clique no botão azul :guilabel:`Update` para salvar as informações no sistema.
