Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/document_editing.po
Languages: pt_pt

source: Document Editing
pt_pt: Edição de Documentos

source: The :ref:`document-info` page makes available useful tools for document editing. Click on the :guilabel:`Edit Document` button to see what you can do to make changes. The picture below shows you the *Editing Panel* that will appear on the screen.
pt_pt: A página :ref:`document-info` disponibiliza ferramentas úteis para a edição de documentos. Clique no botão :guilabel:`Edit Document` para ver o que pode fazer para efectuar alterações. A imagem abaixo mostra o *Painel de Edição* que aparecerá na tela.

source: *Document Editing panel*
pt_pt: *Painel de Edição de documentos*

source: You can *Replace* the document file with another one by clicking on :guilabel:`Replace`. It will drive you to the *Document Upload* page (see :ref:`uploading-documents`) where you can upload a new file.
pt_pt: Você pode *Substituir* o ficheiro por outro clicando em :guilabel:`Replace`. Isso o levará à página *Carregar documentos* (consulte :ref:`uploading-documents`) onde você pode carregar um novo arquivo.

source: The :guilabel:`Remove` button allows you to delete the document. You will have to confirm that choice.
pt_pt: O botão :guilabel:`Remove` permite apagar o documento. Você terá que confirmar essa escolha.

source: *Document Removal confirmation*
pt_pt: *Confirmação de Remoção de documento*

source: The *Editing Panel* shows you also some links for editing the metadata and the thumbnail. These actions will be explained more in depth in the next paragraphs.
pt_pt: O *Painel de Edição* mostra também alguns links para editar os metadados e a miniatura. Estas acções serão explicadas com mais detalhes nos próximos parágrafos.

source: Setting the Document Thumbnail
pt_pt: Configuração da Miniatura do Documento

source: From the *Editing Panel*, it is also possible to *Set the Thumbnail* of the document. Click on :guilabel:`Set` to open the *Thumbnail Uploading* page and chose the image that will illustrate your document. You can either drag and drop it in the *Drop files here* box or selecting from your folders by clicking on *Choose Files*. Once this is done, click on the red button :guilabel:`Upload files`. If the thumbnail has been successfully uploaded you can see it by coming back to the document list. Click on the :guilabel:`Explore Documents` button to check that.
pt_pt: Do *Painel de Edição*, é também possível *Definir a Miniatura* do documento. Clique em :guilabel:`Set` para abrir a página *Carregamento de Miniaturas* e escolha a imagem que irá ilustrar o seu documento. Você pode arrastar e soltar na caixa *Solte os arquivos aqui* ou selecionar de suas pastas clicando em *Escolher arquivos*. Feito isto, clique no botão vermelho :guilabel:`Upload files`. Se a miniatura foi carregada com sucesso, você pode vê-la voltando para a lista de documentos. Clique no botão :guilabel:`Explore Documents` para verificar isso.

source: *Upload Document's Thumbnail*
pt_pt: *Carregar Miniatura do Documento*

source: If no errors occur the following message will be shown.
pt_pt: Se nenhum erro ocorrer, a seguinte mensagem será exibida.

source: *Uploading success*
pt_pt: *Carregamento bem-sucedido*

source: Editing the Document Metadata
pt_pt: Edição dos Metadados do Documento

source: You can edit the metadata of your document through the buttons shown in the red rectangle in below picture.
pt_pt: Você pode editar os metadados do seu documento através dos botões mostrados no rectângulo vermelho na imagem abaixo.

source: *Editing Metadata*
pt_pt: *Edição de Metadados*

source: The :guilabel:`Wizard` button drive you to the wizard described in the :ref:`document-metadata` section. The :guilabel:`Advanced Edit` button takes you to a big form where all the available metadata of the document can be edited.
pt_pt: O botão :guilabel:`Wizard` o leva ao assistente descrito na secção :ref:`document-metadata`. O botão :guilabel:`Advanced Edit` leva-o a um formulário extenso onde todos os metadados disponíveis do documento podem ser editados.

source: Some information are mandatory such as the *Title* or the *Category* the document belongs to, some others are optional.
pt_pt: Algumas informações são obrigatórias, como o *Título* ou a *Categoria* a que o documento pertence, outras são opcionais.

source: In the example shown in the picture above, the information inside the red rectangles have been changed. To save the changes click on :guilabel:`Update`, you will be redirected to the document page.
pt_pt: No exemplo mostrado na imagem acima, as informações dentro dos rectângulos vermelhos foram alteradas. Para salvar as alterações clique em :guilabel:`Update`, e será redireccionado para a página do documento.
