Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/document_info.po
Languages: pt_pt

source: Document Information
pt_pt: Informação do Documento

source: From the *Documents Search Page* (see :ref:`finding-documents`) you can select the document you are interested in and see some basic information about it. You can access the document details page by clicking on its name. That page looks like the one shown in the picture below.
pt_pt: Na *Página de Pesquisa de Documentos* (veja :ref:`pesquisando-documentos`) você pode seleccionar o documento no qual está interessado e ver algumas informações básicas sobre ele. Você pode acessar a página de detalhes do documento clicando em seu nome. Essa página se parece com a mostrada na imagem abaixo.

source: *Document Information page*
pt_pt: *Página de Informações do documento*

source: On the page of a document, the resource is either directly displayed on the page or accessible by clicking on the link provided under the title.
pt_pt: Na página de um documento, o recurso é exibido directamente na página ou acessível clicando no link fornecido sob o título.

source: Exploring the Tabs Sections
pt_pt: Explorando as Secções das Guias

source: There is a *Tab Section* below the document, where you can first view *Info* about the document.
pt_pt: Há uma *Secção de Guia* abaixo do documento, onde você pode primeiro ver *Informações* sobre o documento.

source: The **Info Tab** section shows the document metadata such as its title, abstract, date of publication etc. The metadata also indicates the user who is responsible for uploading and managing this content, as well as the group to which it is linked.
pt_pt: A secção **Guia de Informações** mostra os metadados do documento, como título, resumo, data de publicação, etc. Os metadados também indicam o usuário responsável por enviar e fazer a gestão desse conteúdo, bem como o grupo ao qual ele está vinculado .

source: The **Share Tab** provides the social media links for the document to share. There is also a link to share the document through email.
pt_pt: A **Guia Compartilhar** fornece os links de mídia social para o documento por compartilhar. Também existe um link para compartilhar o documento por e-mail.

source: *Document Sharing*
pt_pt: *Partilha de Documentos*

source: You can **Rate** the document through the *Ratings system*.
pt_pt: Você pode **Classificar** o documento por meio do *Sistema de Classificações*.

source: *Rate the Document*
pt_pt: *Classifique o Documento*

source: In the **Comments Tab** section you can post your comment. Click on :guilabel:`Add Comment`, insert your comment and click :guilabel:`Submit Comment` to post it.
pt_pt: Na secção **Guia de Comentários** você pode postar seu comentário. Clique em :guilabel:`Adicionar Comentário`, insira seu comentário e clique em :guilabel:`Submeter Comentário` para postá-lo.

source: *Document Comments*
pt_pt: *Comentários do Documento*

source: Your comment will be added next to the last already existing comment. If you want to remove it click on the red :guilabel:`Delete` button.
pt_pt: Seu comentário será adicionado ao lado do último comentário já existente. Se você deseja removê-lo, clique no botão vermelho :guilabel:`Excluir`.

source: *Your Comment*
pt_pt: *Seu Comentário*

source: If you want this document in your *Favorites* (see :ref:`editing-profile`), open the **Favorite Tab** and click on :guilabel:`Add to Favorites`.
pt_pt: Se você deseja este documento nos seus *Favoritos* (veja :ref:`edição-de-perfil`), abra a **Guia Favoritos** e clique em :guilabel:`Adicionar aos Favoritos`.

source: *Your Favorite Comment*
pt_pt: *Seu Comentário Favorito*

source: GeoNode also supports the *EXIF (EXchangeable Image Format)* for ``jpeg`` and ``tiff`` image documents. The *EXIF* means that additional information (metadata) are stored within the image, so GeoNode allows you to see those information in the **Exif Tab**.
pt_pt: GeoNode também suporta o *EXIF (EXchangeable Image Format)* para documentos de imagem ``jpeg`` e `` tiff``. O *EXIF* significa que informações adicionais (metadados) são armazenadas na imagem, então o GeoNode permite que você veja essas informações na **Guia Exif**.

source: *The EXIF tab*
pt_pt: *A guia EXIF*

source: The Tools Section
pt_pt: A Secção Ferramentas

source: On the right side of the *Document Page* you can see other useful information such as the links to the resources linked to the document, the document *Owner*, the *Point of Contact* and the *Metadata Author*.
pt_pt: No lado direito da *Página do Documento* você pode ver outras informações úteis, como os links para os recursos vinculados ao documento, o documento *Proprietário*, o *Ponto de Contacto* e o *Autor de Metadados*.

source: *Document useful tool*
pt_pt: *Documentar ferramenta útil*

source: In the same section of the *Document Page* you can find the following useful tool:
pt_pt: Na mesma secção da *Página do Documento*, você pode encontrar a seguinte ferramenta útil:

source: :guilabel:`Metadata Detail` to explore in detail the document metadata (see the next paragraph)
pt_pt: :guilabel:`Detalhe de Metadados` para explorar em detalhes os metadados do documento (veja o próximo parágrafo)

source: :guilabel:`Download Document` to download the document
pt_pt: :guilabel:`Baixar Documento` para baixar o documento

source: :guilabel:`Edit Document` to change the document metadata, replace the file etc (see :ref:`document-editing`)
pt_pt: :guilabel:`Editar Documento` para alterar os metadados do documento, substituir o arquivo etc (veja :ref:`edição-de-documento`)

source: :guilabel:`Download Metadata` to download the whole set of metadata in various formats
pt_pt: :guilabel:`Baixar Metadados` para baixar todo o conjunto de metadados em vários formatos

source: *Document Metadata download*
pt_pt: *Baixar Metadados de Documentos*

source: :guilabel:`Change Document Permissions` to assign permissions on the document to users and groups (see :ref:`edit-document-permissions`).
pt_pt: :guilabel:`Alterar Permissões do Documento` para atribuir permissões no documento a usuários e grupos (veja :ref:`editar-permissões-do-documento`).

source: Exploring Metadata Details
pt_pt: Explorando Detalhes de Metadados

source: When clicking on the :guilabel:`Metadata Detail` button the *Metadata Details Page* will open.
pt_pt: Ao clicar no botão :guilabel: `Detalhe de Metadados` a *Página de Detalhes de Metadados* será aberta.

source: *Document Metadata Details page*
pt_pt: *Página de Detalhes de Metadados do Documento *

source: It displays the whole set of available metadata about the document.
pt_pt: Ele exibe todo o conjunto de metadados disponíveis sobre o documento.

source: Metadata are grouped in order to show the following types of information:
pt_pt: Os metadados são agrupados para mostrar os seguintes tipos de informações:

source: *Identification* to uniquely identify the document
pt_pt: *Identificação* para identificar exclusivamente o documento

source: *Owner*, the user who own the document
pt_pt: *Proprietário*, o usuário que proprietário do documento

source: *Information*, the identification image, the Spatial Extent, Projection System and so on
pt_pt: *Informações*, a imagem de identificação, a extensão espacial, sistema de projecção e assim por diante

source: *Features*, Restrictions, Language and so on
pt_pt: *Recursos*, restrições, Idioma e assim por diante

source: *Contact Points*, the user available to have a contact
pt_pt: *Pontos de Contacto*, o usuário disponível para ter um contacto

source: *References*, various links to the resource information
pt_pt: *Referências*, vários links para as informações de recurso

source: *Metadata Author*, the metadata author information
pt_pt: *Autor de Metadados*, as informações do autor de metadados
