Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/uploading_documents.po
Languages: pt_pt

source: Uploading Documents
pt_pt: Carregando Documentos

source: GeoNode allows to share reports, conceptual notes, posters, spreadsheets, etc. A wide range of documents files can be hosted on the platform, including text files (.doc, .docx, .txt, .odt), spreadsheets (.xls, .xlsx, .ods), presentations (.ppt, .pptx, .odp), images (.gif, .jpg, .png, .tif, .tiff), PDF, zip files (.rar, .zip, .gz), SLD, XML or QML files.
pt_pt: GeoNode permite compartilhar relatórios, notas conceituais, pôsteres, planilhas, etc. Uma grande variedade de arquivos de documentos podem ser hospedados na plataforma, incluindo arquivos de texto (.doc, .docx, .txt, .odt), planilhas (.xls, .xlsx, .ods), apresentações (.ppt, .pptx, .odp), imagens (.gif, .jpg, .png, .tif, .tiff), PDF, arquivos zip (.rar, .zip, .gz ), Arquivos SLD, XML ou QML.

source: Only authenticated users can upload data into GeoNode.
pt_pt: Apenas usuários autenticados podem carregar dados no GeoNode.

source: *Documents* uploading is accessible from two positions:
pt_pt: O carregamento de *Documentos* pode ser acessado de duas posições:

source: the :guilabel:`Upload Documents` button of the *Documents Search* page (see :ref:`finding-documents`)
pt_pt: o botão :guilabel:`Upload Documents` da página *Pesquisa de Documentos* (veja :ref:`finding-documents`)

source: *Documents Upload button*
pt_pt: *Botão Carregar Documentos*

source: the :guilabel:`Upload Document` link of the :guilabel:`Data` menu in the navigation bar
pt_pt: o link :guilabel:`Upload Document` do menu :guilabel:`Data` na barra de navegação

source: *Document Upload link*
pt_pt: *Link Carregar Documento*

source: The *Document Upload* page looks like the one shown in the picture below.
pt_pt: A página de *Carregamento de Documentos* se parece com a mostrada na imagem abaixo.

source: *Document Upload page*
pt_pt: *Página de Carregamento de documentos*

source: In order to upload a document:
pt_pt: Para carregar um documento:

source: select a file from your disk or enter a URL address if the document is stored on the internet
pt_pt: seleccione um arquivo do seu disco ou insira um endereço URL se o documento estiver armazenado na internet

source: insert the title of the document
pt_pt: insira o título do documento

source: select one or more published resources the document can be linked to (optional)
pt_pt: seleccione um ou mais recursos publicados aos quais o documento pode ser vinculado (opcional)

source: click the red :guilabel:`Upload` button
pt_pt: clique no botão vermelho :guilabel:`Upload`

source: At the end of the uploading process you will be driven to the *Metadata* page to fill out other information about the document. See the next section to know more about that.
pt_pt: No final do processo de carregamento, você será direccionado para a página *Metadados* para preencher outras informações sobre o documento. Veja a próxima secção para saber mais sobre isso.
