Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/index.po
Languages: pt_pt

source: GeoNode Basics
pt_pt: Fundamentos do GeoNode

source: is a platform for the management and publication of geospatial data. It brings together mature open-source software projects under an easy to use interface.
pt_pt: é uma plataforma para a gestão e publicação de dados geoespaciais. Ele reúne projectos maduros de software de código aberto em uma interface fácil de usar.

source: *GeoNode simplified architecture*
pt_pt: * Arquitectura simplificada GeoNode *

source: *With GeoNode, non-specialized users can share data and create interactive maps.*
pt_pt: *Com o GeoNode, usuários não especializados podem compartilhar dados e criar mapas interactivos.*

source: Geospatial data storage
pt_pt: Armazenamento de dados geoespaciais

source: GeoNode allows users to upload vector data (currently shapefiles, json, csv, kml and kmz) and raster data in their original projections using a web form.
pt_pt: GeoNode permite aos usuários fazer upload de dados vectoriais (actualmente shapefiles, json, csv, kml e kmz) e dados matriciais (raster) em suas projecções originais usando um formulário da web.

source: Vector data is converted into geospatial tables on a DB, satellite imagery and other kinds of raster data are retained as GeoTIFFs.
pt_pt: Os dados vectoriais são convertidos em tabelas geoespaciais em um banco de dados, imagens de satélite e outros tipos de dados raster são retidos como GeoTIFFs.

source: Special importance is given to standard metadata formats like ISO 19139:2007 / ISO 19115 metadata standards.
pt_pt: É dada importância especial aos formatos padrão de metadados, como os padrões de metadados ISO 19139: 2007 / ISO 19115.

source: As soon as the upload is finished, the user can fill the resource metadata in order to make it suddenly available through the `CSW`_ (OGC Catalogue Service) endpoints and APIs.
pt_pt: Assim que o upload for concluído, o usuário pode preencher os metadados do recurso para torná-lo repentinamente disponível através dos terminais `CSW`_ (Serviço de Catálogo OGC) e APIs.

source: Users may also upload a metadata XML document (ISO, FGDC, and Dublin Core format) to fill key GeoNode metadata elements automatically.
pt_pt: Os usuários podem também, fazer upload de um documento XML de metadados (formato ISO, FGDC e Dublin Core) para preencher os principais elementos de metadados do GeoNode automaticamente.

source: Similarly, GeoNode provides a web based styler that lets the users to change the data portrayals and preview the changes at real time.
pt_pt: Da mesma forma, o GeoNode fornece um estilizador baseado na web que permite aos usuários alterar as representações dos dados e visualizar as alterações em tempo real.

source: Data mixing, maps creation
pt_pt: Mistura de dados, criação de mapas

source: Once the data has been uploaded, GeoNode lets the user search for it geographically or via keywords in order to create fancy maps.
pt_pt: Uma vez que os dados tenham sido carregados, o GeoNode permite ao usuário pesquisá-los geograficamente ou por meio de palavras-chave para criar mapas sofisticados.

source: All the layers are automatically re-projected to web Mercator for maps display, making it possible to use different popular base layers, like Open Street Map, Google Satellite or Bing layers.
pt_pt: Todas as camadas são automaticamente reprojectadas para Web Mercator para exibição de mapas, tornando possível o uso de diferentes camadas de base populares, como Open Street Map, Google Satellite ou Bing layers.

source: Once the maps are saved, it is possible to embed them in any web page or get a PDF version for printing.
pt_pt: Depois de salvos os mapas, é possível inseri-los em qualquer página da web ou obter uma versão em PDF para impressão.

source: GeoNode as a building block
pt_pt: GeoNode como um bloco de construção

source: A handful of other Open Source projects extend GeoNode's functionality by tapping into the re-usability of Django applications.
pt_pt: Vários outros projectos de código aberto estendem a funcionalidade do GeoNode, aproveitando a reusabilidade de aplicativos Django.

source: Visit our gallery to see how the community uses GeoNode: `GeoNode Projects <http://geonode.org/gallery/>`_.
pt_pt: Visite a nossa galeria para ver como a comunidade usa o GeoNode: `Projectos GeoNode <http://geonode.org/gallery/>`_.

source: The development community is very supportive of new projects and contributes ideas and guidance for newcomers.
pt_pt: A comunidade de desenvolvimento apoia muito a novos projectos e contribui com ideias e orientação para os recém-chegados.

source: Convinced! Where do I sign?
pt_pt: Convencido! Onde eu assino?

source: The next steps are:
pt_pt: As próximas etapas são:

source: Make a ride on the :ref:`online_demo`
pt_pt: Faça um passeio pela :ref:`online_demo`

source: Follow the :ref:`quick_setup_guide` in order to play with your own local instance and access all the admin functionalities
pt_pt: Siga o :ref:`quick_setup_guide` de modo a brincar com a sua própria instância local e aceder a todas as funcionalidades de administração

source: Read the documentation starting from the :doc:`user guide </usage/index>` to the :doc:`admin guide </admin/index>`
pt_pt: Leia a documentação iniciando pelo :doc:`guia do usuário </usage/index>` ao :doc:`guia do admin </admin/index>`

source: Subscribe to the `geonode-users`_ and/or `geonode-devel`_ mailing lists to join the community. See also the section :ref:`get_in_touch` for more info.
pt_pt: Inscreva-se nas listas de discussão `usuários-geonode`_ e/ou `desenvolvimento-geonode`_ para se juntar à comunidade. Veja também a secção :ref:`get_in_touch` para mais informações.

source: Thanks for your interest!
pt_pt: Obrigado pelo seu interesse!

source: Supported Browsers
pt_pt: Navegadores Suportados

source: GeoNode is known to be working on all modern web browsers.
pt_pt: GeoNode é conhecido por funcionar em todos os navegadores modernos.

source: This list includes (but is not limited to):
pt_pt: Esta lista inclui (mas não está limitada a):

source: The vast majority of GeoNode developers prefer using Google Chrome.
pt_pt: A grande maioria dos desenvolvedores GeoNode prefere usar o Google Chrome.

source: Versions of Microsoft Internet Explorer older than 10, exhibit known issues when used to browse a GeoNode site. As such a message is displayed warning the user that they should upgrade their browser.
pt_pt: As versões do Microsoft Internet Explorer anteriores a 10, apresentam problemas conhecidos quando usados para navegar em um site GeoNode. Assim, uma mensagem é exibida avisando ao usuário que ele deve actualizar o seu navegador.

source: *Internet Explorer error message*
pt_pt: *Mensagem de erro do Internet Explorer*

source: Testing on Internet Explorer
pt_pt: A testar no Internet Explorer

source: When working on front end code, developers should take care to test carefully with Microsoft Internet Explorer to ensure that the features they are working on do indeed work correctly and on this browser. It is good practice to test on all browsers available, but the use of modern front end libraries like bootstrap and jQuery make it much more likely code will work across browsers seamlessly.
pt_pt: Ao trabalhar no código de front-end, os desenvolvedores devem ter o cuidado de testar cuidadosamente com o Microsoft Internet Explorer, para garantir que os recursos em que estão a trabalhar realmente funcionem correctamente neste navegador. É uma boa prática testar em todos os navegadores disponíveis, mas o uso de bibliotecas modernas de front-end, como bootstrap e jQuery, torna muito mais provável que o código funcione perfeitamente em todos os navegadores.

source: In order to test on Internet Explorer, developers can use the `Modern IE <https://www.modern.ie/en-us>`_ site to download virtual machines for use in `Oracle VM Virtual Box <https://www.virtualbox.org/>`_.
pt_pt: Para testar no Internet Explorer, os desenvolvedores podem usar o site `Modern IE <https://www.modern.ie/en-us>`_ para baixar máquinas virtuais para uso no `Oracle VM Virtual Box <https:// www.virtualbox.org/>`_.

source: *Testing on Internet Explorer*
pt_pt: *A testar no Internet Explorer*

source: Once the VM is downloaded, follow the instructions to configure it in your VirtualBox setup.
pt_pt: Depois de fazer o download da VM, siga as instruções para configurá-la na sua instalação do VirtualBox.

source: *Oracle VirtualBox admin interface*
pt_pt: *Interface de administração do Oracle VirtualBox*

source: After the VM is setup, you can access your development instance of GeoNode by visiting the IP address of your host machine or on the bridged interface (usually 10.0.2.2) and begin your testing.
pt_pt: Depois que a VM for configurada, você pode aceder à sua instância de desenvolvimento do GeoNode, visitando o endereço IP de sua máquina anfitriã ou na interface no modo bridge (geralmente 10.0.2.2) e começar os seus testes.

source: Online Demo
pt_pt: Demonstração Online

source: **Disclaimer** we do not guarantee for any data published on this Demo Site. Publish the data at your own risk. Every dataset will be removed automatically every Sunday. If you find some dataset that shouldn't be there, please write suddenly to developers and maintainers.
pt_pt: **Isenção de responsabilidade** não damos nenhuma garantia por quaisquer dados publicados neste Site de Demonstração. Publique os dados por sua própria conta e risco. Cada conjunto de dados será removido automaticamente todos os domingos. Se encontrar algum conjunto de dados que não deveria lá estar, escreva imediatamente para os desenvolvedores e mantenedores.

source: See the section :ref:`get_in_touch` for details.
pt_pt: Veja a secção :ref:`get_in_touch` para detalhes.

source: A live demo of the latest stable build is available at http://master.demo.geonode.org/.
pt_pt: Uma demonstração em tempo real da versão estável mais recente está disponível em http://master.demo.geonode.org/.

source: *Online Demo @ master.demo.geonode.org*
pt_pt: *Demonstração Online @ master.demo.geonode.org*

source: Anyone may sign up for a user account, upload and style data, create and share maps, and change permissions.
pt_pt: Qualquer pessoa pode se inscrever para uma conta de usuário, fazer upload e modelar dados, criar e compartilhar mapas e alterar permissões.

source: Since it is a demo site, every sunday all the datasets will be wiped out. Users, passwords and groups will be preserved.
pt_pt: Por ser um site de demonstração, aos domingos, todos os conjuntos de dados serão apagados. Usuários, senhas e grupos serão preservados.

source: It should hopefully allow you to easily and quickly make a tour of the main capabilities of GeoNode.
pt_pt: Isso deve permitir que você faça uma excursão pelos principais recursos do GeoNode de forma rápida e fácil.

source: This GeoNode instance is configured with standards settings and a very low security level. This is a demo only not to be considered a really production ready system. For a complete list of settings, refer to the section: :ref:`settings`
pt_pt: Esta instância do GeoNode está configurada com definições padrão e um nível de segurança muito baixo. Esta é uma demonstração apenas, não deve ser considerado um sistema realmente pronto para a produção. Para uma lista completa de configurações, consulte a seção: :ref:`settings`

source: Quick Installation Guide
pt_pt: Guia de Instalação Rápido
