Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/start/quick/index.po
Languages: pt_pt

source: Quick Installation Guide
pt_pt: Guia de Instalação Rápido

source: Introduction
pt_pt: Introdução

source: The following is a quick guide to get started with GeoNode in most common operating systems.
pt_pt: A seguir, um guia rápido para começar a usar o GeoNode na maioria dos sistemas operativos comuns.

source: For a full setup and deployment, please refer to the :doc:`complete installation guides </install/index>`
pt_pt: Para uma configuração completa e implantação, consulte os :doc:`guias de instalação completos </install/index>`

source: This is meant to be run on a fresh machine with no previously installed packages or GeoNode versions.
pt_pt: Isso deve ser executado em uma máquina nova, sem pacotes ou versões do GeoNode previamente instalados.

source: The methods presented here are meant to be used for a limited internal demo only. Before exposing your GeoNode instance to a public server, please read carefully the :doc:`hardening guide </advanced/hardening/index>`
pt_pt: Os métodos apresentados aqui, devem ser usados apenas para uma demonstração interna limitada. Antes de expor sua instância GeoNode a um servidor público, leia com atenção o :doc:`guia de protecção </advanced/hardening/index>`

source: Recommended Minimum System Requirements
pt_pt: Requisitos Mínimos Recomendados do Sistema

source: A definite specification of technical requirements is difficult to recommend. Accepted performance is highly subjective. Furthermore, the performance depends on factors such as concurrent users, records in the database or the network connectivity of your infrastructure.
pt_pt: Uma especificação definitiva de requisitos técnicos é difícil de recomendar. O desempenho aceite é altamente subjectivo. Além disso, o desempenho depende de factores como usuários simultâneos, registos na base de dados ou a conectividade de rede da sua infraestrutura.

source: For deployment of GeoNode on a single server, the following are the *bare minimum* system requirements:
pt_pt: Para a implantação do GeoNode em um único servidor, os seguintes são os requisitos *mínimos* do sistema:

source: 8GB of RAM (16GB or more preferred for a production deployment).
pt_pt: 8GB de RAM (16GB ou mais de preferência para uma implantação de produção).

source: 2.2GHz processor with 4 cores. (Additional processing power may be required for multiple concurrent styling renderings)
pt_pt: Processador de 2,2GHz com 4 núcleos. (Poder de processamento adicional pode ser necessário para várias renderizações de estilo simultâneas)

source: 30 GB software disk usage (Reserved to OS and source code only).
pt_pt: 30 GB de capacidade de disco ocupado pelo software (Reservado apenas ao Sistema Operativo e ao código-fonte).

source: Additional disk space for any data hosted with GeoNode, data stored on the DataBase and tiles cached with GeoWebCache. For db, spatial data, cached tiles, and "scratch space" useful for administration, a decent baseline size for GeoNode deployments is between 50GB and 100GB.
pt_pt: Espaço adicional em disco para quaisquer dados hospedados com o GeoNode, dados armazenados na Base de Dados e blocos armazenados em cache com GeoWebCache. Para a bd, dados espaciais, blocos em cache e "espaço temporário" úteis para administração, um tamanho de base decente para implantações GeoNode está entre 50 GB e 100 GB.

source: 64-bit hardware **strongly** recommended.
pt_pt: Hardware de 64 bits **fortemente** recomendado.

source: OSGEO Live CD
pt_pt: CD OSGEO Executável

source: `OSGeoLive <http://live.osgeo.org/>`_ is a self-contained bootable DVD, USB thumb drive or Virtual Machine based on Lubuntu, that allows you to try a wide variety of open source geospatial software without installing anything.
pt_pt: `OSGeoLive <http://live.osgeo.org/>`_ é um DVD independente auto-inicializável, pen drive USB ou máquina virtual baseada em Lubuntu, que lhe permite experimentar uma grande variedade de software geoespacial de código aberto sem instalar nada.

source: It is composed entirely of free software, allowing it to be freely distributed, duplicated and passed around.
pt_pt: É composto inteiramente de software livre, permitindo que seja livremente distribuído e duplicado.

source: It provides pre-configured applications for a range of geospatial use cases, including storage, publishing, viewing, analysis and manipulation of data.
pt_pt: Ele fornece aplicativos pré-configurados para uma variedade de casos de uso geoespaciais, incluindo armazenamento, publicação, visualização, análise e manipulação de dados.

source: It also contains sample datasets and documentation.
pt_pt: Ele também contém conjuntos de dados de amostra e documentação.

source: To try out the applications, simply:
pt_pt: Para experimentar os aplicativos, basta:

source: Insert DVD or USB thumb drive in computer or virtual machine.
pt_pt: Inserir o DVD ou pen drive USB no computador ou máquina virtual.

source: Reboot computer. (verify boot device order if necessary)
pt_pt: Reinicialize o computador. (verifique a ordem do dispositivo de inicialização, se necessário)

source: Press :guilabel:`Enter` to startup & login.
pt_pt: Pressione :guilabel:`Enter` para iniciar e fazer o login.

source: Select and run applications from the :guilabel:`Geospatial` menu.
pt_pt: Seleccione e execute aplicativos a partir do menu :guilabel:`Geoespacial`.

source: `OSGeoLive <http://live.osgeo.org/>`_ is an `OSGeo Foundation <http://osgeo.org/>`_ project. The `OSGeo Foundation <http://osgeo.org/>`_ is a not-for-profit supporting Geospatial Open Source Software development, promotion and `education <http://www.geoforall.org/>`_.
pt_pt: `OSGeoLive <http://live.osgeo.org/>`_ é um projecto da `Fundação OSGeo <http://osgeo.org/>`_. A `Fundação OSGeo <http://osgeo.org/>`_ é sem fins lucrativos, que apoia o Desenvolvimento de Software Geoespacial de Código Aberto, promoção e `educação <http://www.geoforall.org/>`_.

source: Install via Docker
pt_pt: Instalar via Docker

source: `Docker <https://www.docker.com/>`_ is a free software platform used for packaging software into standardized units for development, shipment and deployment.
pt_pt: `Docker <https://www.docker.com/>`_ é uma plataforma de software livre usado para empacotar software em unidades padronizadas para desenvolvimento, remessa e implantação.

source: credits to Docker
pt_pt: créditos para Docker

source: Introducing main concepts
pt_pt: Apresentando os conceitos principais

source: A container image is a lightweight, stand-alone, executable package of a piece of software that includes everything needed to run it: code, runtime, system tools, system libraries, settings.
pt_pt: Uma imagem de container é um pacote leve, autônomo e executável de um software que inclui tudo o que é necessário para executá-lo: código, tempo de execução, ferramentas do sistema, bibliotecas do sistema, configurações.

source: Docker containers running on a single machine share that machine's operating system kernel; they start instantly and use less compute and RAM.
pt_pt: Os containers do Docker em execução em uma única máquina compartilham o kernel do sistema operativo dessa máquina; eles iniciam instantaneamente e usam menos computação e RAM.

source: Containers can share a single kernel, and the only information that needs to be in a container image is the executable and its package dependencies, which never need to be installed on the host system.
pt_pt: Os containers podem compartilhar um único kernel e as únicas informações que precisam estar em uma imagem do container são o executável e suas dependências de pacote, que nunca precisam ser instalados no sistema anfitrião.

source: Multiple containers can run on the same machine and share the OS kernel with other containers, each running as isolated processes in user space.
pt_pt: Vários containers podem ser executados na mesma máquina e compartilhar o kernel do sistema operativo com outros containers, cada um a executar como processos isolados no espaço do usuário.

source: The following tutorials will introduce the use of Docker community edition on:
pt_pt: Os seguintes tutoriais irão apresentar o uso do Docker community edition em:
