Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/start/index.po
Languages: es

source: GeoNode Basics
es: Conceptos básicos de GeoNode

source: is a platform for the management and publication of geospatial data. It brings together mature open-source software projects under an easy to use interface.
es: es una plataforma para la gestión y publicación de datos geoespaciales. Reúne proyectos de software de código abierto maduros bajo una interfaz fácil de usar.

source: *GeoNode simplified architecture*
es: *Arquitectura simplificada de GeoNode*

source: *With GeoNode, non-specialized users can share data and create interactive maps.*
es: *Con GeoNode, los usuarios no especializados pueden compartir datos y crear mapas interactivos.*

source: Geospatial data storage
es: Almacenamiento de datos geoespaciales

source: GeoNode allows users to upload vector data (currently shapefiles, json, csv, kml and kmz) and raster data in their original projections using a web form.
es: GeoNode permite a los usuarios cargar datos vectoriales (actualmente shapefiles, json, csv, kml y kmz) y datos ráster en sus proyecciones originales utilizando un formulario web.

source: Vector data is converted into geospatial tables on a DB, satellite imagery and other kinds of raster data are retained as GeoTIFFs.
es: Los datos vectoriales se convierten en tablas geoespaciales en una base de datos, las imágenes satelitales y otros tipos de datos ráster se conservan como GeoTIFFs.

source: Special importance is given to standard metadata formats like ISO 19139:2007 / ISO 19115 metadata standards.
es: Se da especial importancia a los formatos de metadatos estándar como ISO 19139:2007 / ISO 19115.

source: As soon as the upload is finished, the user can fill the resource metadata in order to make it suddenly available through the `CSW`_ (OGC Catalogue Service) endpoints and APIs.
es: Tan pronto como se completa la carga, el usuario puede completar los metadatos del recurso para que estén disponibles inmediatamente a través de los endpoints y API de CSW_ (Servicio de Catálogo OGC).

source: Users may also upload a metadata XML document (ISO, FGDC, and Dublin Core format) to fill key GeoNode metadata elements automatically.
es: Los usuarios también pueden cargar un documento XML de metadatos (formato ISO, FGDC y Dublin Core) para completar automáticamente los elementos clave de metadatos de GeoNode.

source: Similarly, GeoNode provides a web based styler that lets the users to change the data portrayals and preview the changes at real time.
es: De manera similar, GeoNode proporciona un estilizador basado en la web que permite a los usuarios cambiar las representaciones de datos y previsualizar los cambios en tiempo real.

source: Data mixing, maps creation
es: Mezcla de datos, creación de mapas

source: Once the data has been uploaded, GeoNode lets the user search for it geographically or via keywords in order to create fancy maps.
es: Una vez que los datos han sido cargados, GeoNode permite al usuario buscarlos geográficamente o por palabras clave para crear mapas atractivos.

source: All the datasets are automatically re-projected to web Mercator for maps display, making it possible to use different popular base datasets, like Open Street Map, Google Satellite or Bing datasets.
es: Todos los conjuntos de datos se reproyectan automáticamente a web Mercator para la visualización de mapas, lo que permite utilizar diferentes conjuntos de datos base populares, como OpenStreetMap, Google Satellite o Bing.

source: Once the maps are saved, it is possible to embed them in any web page or get a PDF version for printing.
es: Una vez que los mapas se guardan, es posible incrustarlos en cualquier página web u obtener una versión en PDF para imprimir.

source: GeoNode as a building block
es: GeoNode como bloque de construcción

source: A handful of other Open Source projects extend GeoNode's functionality by tapping into the re-usability of Django applications.
es: Varios otros proyectos de código abierto amplían la funcionalidad de GeoNode aprovechando la reutilización de aplicaciones Django.

source: Visit our gallery to see how the community uses GeoNode: `GeoNode Projects <http://geonode.org/gallery/>`_.
es: Visita nuestra galería para ver cómo la comunidad utiliza GeoNode: `Galería GeoNode <http://geonode.org/gallery/>`_.

source: The development community is very supportive of new projects and contributes ideas and guidance for newcomers.
es: La comunidad de desarrollo apoya mucho los nuevos proyectos y contribuye con ideas y orientación para los recién llegados.

source: Convinced! Where do I sign?
es: ¡Convencido! ¿Dónde firmo?

source: The next steps are:
es: Los siguientes pasos son:

source: Make a ride on the :ref:`online_demo`
es: Haz un recorrido en la :ref:`online_demo`

source: Follow the :ref:`quick_setup_guide` in order to play with your own local instance and access all the admin functionalities
es: Sigue la :ref:`quick_setup_guide` para jugar con tu propia instancia local y acceder a todas las funcionalidades de administración

source: Read the documentation starting from the :doc:`user guide </usage/index>` to the :doc:`admin guide </admin/index>`
es: Lee la documentación empezando por la :doc:`user guide </usage/index>` hasta la :doc:`admin guide </admin/index>`

source: Subscribe to the `geonode-users`_ and/or `geonode-devel`_ mailing lists to join the community. See also the section :ref:`get_in_touch` for more info.
es: Suscríbete a las listas de correo `geonode-users` y/o `geonode-devel`_ para unirte a la comunidad. Consulta también la sección :ref:`get_in_touch` para más información.

source: Thanks for your interest!
es: ¡Gracias por tu interés!

source: Supported Browsers
es: Navegadores soportados

source: GeoNode is known to be working on all modern web browsers.
es: Se sabe que GeoNode funciona en todos los navegadores web modernos.

source: This list includes (but is not limited to):
es: Esta lista incluye (pero no se limita a):

source: The vast majority of GeoNode developers prefer using Google Chrome.
es: La gran mayoría de los desarrolladores de GeoNode prefieren usar Google Chrome.

source: Online Demo
es: Demostración en línea

source: **Disclaimer** we do not guarantee for any data published on this Demo Site. Publish the data at your own risk. Every dataset will be removed automatically every Sunday. If you find some dataset that shouldn't be there, please write suddenly to developers and maintainers.
es: **Descargo de responsabilidad** no garantizamos ningún dato publicado en este sitio de demostración. Publica los datos bajo tu propio riesgo. Todos los conjuntos de datos se eliminarán automáticamente todos los domingos. Si encuentras algún conjunto de datos que no debería estar allí, por favor escribe inmediatamente a los desarrolladores y mantenedores.

source: See the section :ref:`get_in_touch` for details.
es: Consulta la sección :ref:`get_in_touch` para obtener detalles.

source: A live demo of the latest stable build is available at http://master.demo.geonode.org/.
es: Una demostración en vivo de la última versión estable está disponible en http://demo.geonode.org/.

source: *Online Demo @ master.demo.geonode.org*
es: *Demostración en línea @ demo.geonode.org*

source: Anyone may sign up for a user account, upload and style data, create and share maps, and change permissions.
es: Cualquiera puede registrarse para obtener una cuenta de usuario, cargar y estilizar datos, crear y compartir mapas, y cambiar permisos.

source: Since it is a demo site, every sunday all the datasets will be wiped out. Users, passwords and groups will be preserved.
es: Dado que es un sitio de demostración, todos los domingos se eliminarán todos los conjuntos de datos. Los usuarios, contraseñas y grupos se conservarán.

source: It should hopefully allow you to easily and quickly make a tour of the main capabilities of GeoNode.
es: Esperamos que te permita realizar fácilmente un recorrido rápido por las principales capacidades de GeoNode.

source: This GeoNode instance is configured with standards settings and a very low security level. This is a demo only not to be considered a really production ready system. For a complete list of settings, refer to the section: :ref:`settings`
es: Esta instancia de GeoNode está configurada con configuraciones estándar y un nivel de seguridad muy bajo. Esta es solo una demostración y no debe considerarse un sistema realmente listo para producción. Para una lista completa de configuraciones, consulta la sección: :ref:`settings`

source: Quick Installation Guide
es: Guía rápida de instalación
