Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/other_apps/dashboard/index.po
Languages: es

source: Dashboard
es: Dashboards

source: Dashboard is a MapStore tool integrated in GeoNode that provides the user with a space to add many Widgets, such as charts, maps, tables, texts and counters, and can create connections between them in order to:
es: Dashboards una herramienta de MapStore integrada en GeoNode que proporciona al usuario un espacio para agregar muchos Widgets, como gráficos, mapas, tablas, textos y contadores, y puede crear conexiones entre ellos con el fin de:

source: Provide an overview to better visualize a specific data context
es: Proporcionar una visión general para visualizar mejor un contexto de datos específico.

source: Interact spatially and analytically with the data by creating connections between widgets
es: Interactuar espacial y analíticamente con los datos mediante la creación de conexiones entre widgets.

source: Perform analysis on involved data/layers
es: Realizar análisis sobre los datos/capas involucrados.

source: To build a new Dashboard go to :guilabel:`Add Resource` option on the resource page and choose option *Create dashboard*.
es: Para construir un nuevo Panel de Control, ve a la opción \:guilabel\:`Agregar recurso` en la página de recursos y elige la opción *Crear dashboard*.

source: *New Dashboard Apps option*
es: *Opciones de Agregar recurso*

source: Now you landed on the Dashboard edition page that is composed of the following sections:
es: Ahora te encuentras en la página de edición del Panel de Control, que está compuesta por las siguientes secciones:

source: Further Reading
es: Lecturas adicionales

source: Follow the link below to get more detailed information about the usage of Dashboard.
es: Sigue el enlace a continuación para obtener información más detallada sobre el uso del Panel de Control.

source: `Dashboard Documentation <https://mapstore.readthedocs.io/en/latest/user-guide/exploring-dashboards>`_
es: `Documentación de Dashboard <https://mapstore.readthedocs.io/en/latest/user-guide/exploring-dashboards>`_
