Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/other_apps/geostory/index.po
Languages: pt

source: GeoStory is a MapStore tool integrated in GeoNode that provides the user a way to create inspiring and immersive stories by combining text, interactive maps, and other multimedia content like images and video or other third party contents. Through this tool you can simply tell your stories on the web and then publish and share them with different groups of GeoNode users or make them public to everyone around the world.
pt: GeoStory é uma ferramenta do MapStore integrada no GeoNode que possibilita ao utilizador criar histórias inspiradoras e imersivas combinando texto, mapas interactivos e outros conteúdos multimédia como imagens e vídeos entre outros conteúdos. Através desta ferramenta pode divulgar as suas histórias na web e depois publicá-las e partilhá-las com diferentes grupos do GeoNode ou publicá-las para todas as pessoas no mundo.

source: *New GeoStory Apps option*
pt: *Opção de Nova GeoStory*

source: Now you landed on the GeoStory edition page that is composed of the following sections:
pt: Agora entrou na página de edição da GeoStory que é composta das seguintes secções:

source: The GeoStory content is organized in Sections, that can be added with the |add_section| button in the *Container* area. In particular, the user can add to the story the following kind of sections:
pt: O conteúdo da GeoStory está organizado em Secções que podem ser adicionadas através do botão |add_section| na área de *Container*. Em particular, o utilizador poderá adicionar os seguintes tipos de secções à sua história:

source: *GeoStory Sections Types*
pt: *Tipos de Secção de uma GeoStory*

source: For more information on these specific section please follow the official MapStore documentation:
pt: Para mais informação sobre estas secções em específico por favor sigam a ligação para a documentação oficial do MapStore:

source: `Title Section <https://mapstore.readthedocs.io/en/latest/user-guide/title-section/>`_
pt: `Secção de Título <https://mapstore.readthedocs.io/en/latest/user-guide/title-section/>`_

source: `Banner Section <https://mapstore.readthedocs.io/en/latest/user-guide/banner-section/>`_
pt: `Secção de Banner <https://mapstore.readthedocs.io/en/latest/user-guide/banner-section/>`_

source: `Paragraph Section <https://mapstore.readthedocs.io/en/latest/user-guide/paragraph-section/>`_
pt: `Secção de Parágrafo <https://mapstore.readthedocs.io/en/latest/user-guide/paragraph-section/>`_

source: `Immersive Section <https://mapstore.readthedocs.io/en/latest/user-guide/immersive-section/>`_
pt: `Secção Immersiva <https://mapstore.readthedocs.io/en/latest/user-guide/immersive-section/>`_

source: `Media Section <https://mapstore.readthedocs.io/en/latest/user-guide/media-section/>`_
pt: `Secção de Média <https://mapstore.readthedocs.io/en/latest/user-guide/media-section/>`_

source: `Web Page Section <https://mapstore.readthedocs.io/en/latest/user-guide/web-section/>`_
pt: `Secção de Página Web <https://mapstore.readthedocs.io/en/latest/user-guide/web-section/>`_

source: Add GeoNode content to GeoStory
pt: Adicionar conteúdos do GeoNode na GeoStory

source: With GeoNode you can add content to your GeoStory using internal GeoNode documents and maps as well external sources. This ability to add internal GeoNode content makes the GeoStory creation a very usefull feature.
pt: Com o GeoNode pode adicionar conteúdos para a sua GeoStory utilizando documentos e mapas internos no GeoNode bem como fontes externas. Esta possibilidade de adicionar conteúdos internos do GeoNode é muito útil na criação de uma GeoStory.

source: To add GeoNode content to your GeoStory use the |edit_mode| button on top of your GeoStory section.
pt: Para adicionar conteúdo à sua GeoStory utilizar o botão |edit_mode| no topo da secção da sua GeoStory.

source: From here you can add :guilabel:`Images`, :guilabel:`Videos` and :guilabel:`Maps`. To enable GeoNode internal catalog, on :guilabel:`Services` dropdown choose :guilabel:`GeoNode` as shown in picture down. On the left you get a list of media documents available with a complementary text filter feature on top.
pt: Daí poderá adicionar :guilabel:`Images`, :guilabel:`Videos` e :guilabel:`Maps`. Para abilitar o catálogo interno do GeoNode, no menu dropdown :guilabel:`Services` escolher :guilabel:`GeoNode` como é exibido na imagem em baixo. Na lateral esquerda tem uma lista de documentos disponíveis com um campo de texto no topo de filtragem complementar.

source: *Add Media to GeoStory*
pt: *Adicionar Media à GeoStory*

source: Now your GeoStory can be shared with everyone!
pt: Agora a sua GeoStory já pode ser partilhada com todos!

source: Further Reading
pt: Leitura Complementar

source: Follow the link below to get more detailed information about the usage of GeoStory.
pt: Siga a ligação em baixo para ver com mais detalhe a informação de como utilizar o GeoStory.

source: `GeoStory Documentation <https://mapstore.readthedocs.io/en/latest/user-guide/exploring-stories>`_
pt: `Documentação do GeoStory <https://mapstore.readthedocs.io/en/latest/user-guide/exploring-stories>`_
