Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_layers/layer_info.po
Languages: pt_pt

source: Layer Information
pt_pt: Informação da Camada

source: In this section you will learn more about layers. In the :ref:`finding-layers` section we explain how to find layers, now we want to go more in depth showing you how to explore detailed information about that.
pt_pt: Nesta secção, você aprenderá mais sobre camadas. Na secção :ref:`pesquisando-camadas` explicamos como encontrar camadas, agora queremos ir mais a fundo mostrando como explorar informações detalhadas sobre isso.

source: From the layers list page, click on the layer you are interested in. The *Layer Page* will open.
pt_pt: Na página da lista de camadas, clique na camada de seu interesse. A *Página de Camadas * será aberta.

source: *Layer Information*
pt_pt: *Informação da Camada*

source: As shown in the picture above, the *Layer Page* is divided into three main sections:
pt_pt: Conforme mostrado na imagem acima, a *Página de Camadas* é dividida em três secções principais:

source: the *Layer Preview* section, under the title
pt_pt: a secção *Pré-visualização da Camada*, sob o título

source: the *Tabs* section, under the layer preview
pt_pt: a secção *Guias*, sob a pré-visualização da camada

source: the *Tools* section, on the right side of the page
pt_pt: a secção *Ferramentas*, no lado direito da página

source: Layer Preview
pt_pt: Antevisão da Camada

source: The *Layer Preview* shows the layer in a map with very basic functionalities:
pt_pt: A *Pré-visualização da Camada* mostra a camada em um mapa com funcionalidades muito básicas:

source: the *Base Map Switcher* that allows you to change the base map;
pt_pt: o *Comutador de Mapa Básico* que permite alterar o mapa básico;

source: the *Zoom in/out* tool to enlarge and decrease the view;
pt_pt: a ferramenta *Zoom in/out* para ampliar e encolher a visualização;

source: the *Zoom to max extent* tool for the zoom to fit the layer size;
pt_pt: a ferramenta *Zoom na extensão máxima* para que o zoom se ajuste ao tamanho da camada;

source: the *Query Objects* tool to retrieve information about the map objects by clicking on the map;
pt_pt: a ferramenta *Consulta de Objectos* para recuperar informações sobre os objectos do mapa clicando no mapa;

source: the *Print* tool to print the preview.
pt_pt: a ferramenta *Imprimir* para imprimir a pré-visualização.

source: *Layer Preview*
pt_pt: *Pré-visualização da Camada*

source: The GeoNode map viewer is `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ based, see the `MapStore Documentation <https://mapstore2.readthedocs.io/en/latest/>`_ to learn more.
pt_pt: O visualizador de mapa GeoNode é baseado em `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_, consulte a `Documentação MapStore <https://mapstore2.readthedocs.io/en/latest/> `_ para saber mais.

source: Tabs Sections
pt_pt: Secções de Guias

source: The *Layer Page* shows you some tabs sections containing different information about the layer:
pt_pt: A *Página da Camada* mostra algumas secções das guias contendo diferentes informações sobre a camada:

source: The tab *Info* is active by default. This tab section shows some layer metadata such as its title, the abstract, date of publication etc. The metadata also indicates the layer owner, what are the topic categories the layer belongs to and which regions are affected.
pt_pt: A guia *Informações* está activa por padrão. Esta secção da guia mostra alguns metadados da camada, como título, resumo, data de publicação, etc. Os metadados também indicam o proprietário da camada, a quais categorias de tópico a camada pertence e quais regiões são afectadas.

source: *Layer Info tab*
pt_pt: *Guia Informações da Camada*

source: The *Attributes* tab shows the data structure behind the layer. All the attributes are listed and for each of them some statistics (e.g. the range of values) are estimated (if possible).
pt_pt: A guia *Atributos* mostra a estrutura de dados por trás da camada. Todos os atributos são listados e para cada um deles algumas estatísticas (por exemplo, a faixa de valores) são estimados (se possível).

source: *Layer Attributes tab*
pt_pt: *Guia de Atributos da Camada*

source: The *Share* tab provides the links for the layer to share through social media or email.
pt_pt: A guia *Compartilhar* fornece os links para a camada compartilhar pela mídia social ou e-mail.

source: *Layer Sharing*
pt_pt: *Compartilhamento de Camadas*

source: You can *Rate* the layer through the *Rating system*.
pt_pt: Você pode *Classificar* a camada por meio do *Sistema de Classificação*.

source: *Rate the Layer*
pt_pt: *Classifique a Camada*

source: In the *Comments* tab section you can post your comment. Click on :guilabel:`Add Comment`, insert your comment and click :guilabel:`Submit Comment` to post it.
pt_pt: Na secção da guia *Comentários*, você pode postar seu comentário. Clique em :guilabel:`Adicionar Comentário`, insira seu comentário e clique em :guilabel:`Submeter Comentário` para postá-lo.

source: *Layer Comments*
pt_pt: *Camada de Comentários*

source: Your comment will be added next to the last already existing comment. If you want to remove it click on the red :guilabel:`Delete` button.
pt_pt: Seu comentário será adicionado ao lado do último comentário já existente. Se você deseja removê-lo, clique no botão vermelho :guilabel:`Excluir`.

source: If you want this layer in your *Favorites* (see :ref:`editing-profile`), open the *Favorite* tab and click on :guilabel:`Add to Favorites`.
pt_pt: Se você deseja esta camada em seus *Favoritos* (veja :ref:`edição-de-perfil`), abra a guia *Favoritos* e clique em :guilabel:`Adicionar aos Favoritos`.

source: *Your Favorite Layer*
pt_pt: *Sua Camada Favorita*

source: Layer Tools
pt_pt: Ferramentas de Camada

source: In the right side of the *Layer Page* there are some buttons and information that can help you to manage your layer. This paragraph will cover only those tools which show layers information. The *Editing Tools* will be explored in the :ref:`layer-editing` section.
pt_pt: No lado direito da *Página de Camada*, existem alguns botões e informações que podem ajudá-lo a fazer a gestão da sua camada. Este parágrafo cobrirá apenas as ferramentas que mostram informações de camadas. As *Ferramentas de Edição* serão exploradas na secção :ref:`edição-de-camadas`.

source: through the :guilabel:`Download Layer` button you can download your layer with some options, see :ref:`layer-download`;
pt_pt: através do botão :guilabel:`Baixar Camada` você pode baixar sua camada com algumas opções, veja :ref:`baixar-camada`;

source: the :guilabel:`Metadata Detail` button to see the layer metadata, see :ref:`layer-metadata` to read more;
pt_pt: o botão :guilabel:`Detalhes de Metadados` para ver os metadados da camada, consulte :ref:`metadados-da-camada` para ler mais;

source: the :guilabel:`Editing Tools` button allows you to access to many editing tools. Those functionalities will be explained in the :ref:`layer-editing` section;
pt_pt: o botão :guilabel:`Ferramentas de Edição` permite que você acesse muitas ferramentas de edição. Essas funcionalidades serão explicadas na secção :ref:`edição-de-camadas`;

source: the :guilabel:`View Layer` button opens the layer loaded in a map, see the :ref:`map-info` for more details;
pt_pt: o botão :guilabel:`Ver Camda` abre a camada carregada em um mapa, veja o :ref:`informação-do-mapa` para mais detalhes;

source: the :guilabel:`Download Metadata` button allows you to download the layer metadata in various formats;
pt_pt: o botão :guilabel:`Baixar Metadados` permite que você baixe os metadados da camada em vários formatos;

source: the *Legend* shows what the symbols and styles on the map are referring to;
pt_pt: a *Legenda* mostra a que símbolos e estilos no mapa se referem;

source: in the *Map using this layer* section all the map which uses the layer are listed;
pt_pt: na secção *Mapa usando esta camada* todos os mapas que usam a camada são listados;

source: in the *Create a map using this layer*, the :guilabel:`Create a Map` button allows you to create a map from scratch using the layer;
pt_pt: em *Criar um mapa usando esta camada*, o botão :guilabel:`Criar um Mapa` permite que você crie um mapa do zero usando a camada;

source: the section *Add the layer to an existing map* shows you a dropdown menu in which all the maps the user can view are listed. The button :guilabel:`Add to Map` allows you to add the layer to the map you have selected in the previous menu;
pt_pt: a secção *Adicionar a camada a um mapa existente* mostra um menu suspenso no qual todos os mapas que o usuário pode visualizar são listados. O botão :guilabel:`Adicionar ao mapa` permite que você adicione a camada ao mapa que você seleccionou no menu anterior;

source: the *Styles* section shows all the styles associated with the layer. Click on the checkbox corresponding to one of the styles listed to apply it the preview;
pt_pt: a secção *Estilos* mostra todos os estilos associados à camada. Clique na caixa de selecção correspondente a um dos estilos listados para aplicá-lo na visualização;

source: *Change the Layer Style in preview*
pt_pt: *Altere o estilo da camada na pré-visualização*

source: in the *Refresh Attributes and Statistics of this layer* section the :guilabel:`Refresh Attributes and Statistics` allows GeoNode to refresh the list of available Layer Attributes. If the option 'WPS_ENABLED' has been also set on the backend, it will recalculate their statistics too;
pt_pt: na secção *Actualizar atributos e estatísticas desta camada* o :guilabel:`Actualizar atributos e estatísticas` permite que o GeoNode actualize a lista de atributos de camada disponíveis. Se a opção 'WPS_ENABLED' também foi definida no backend, ele irá recalcular suas estatísticas também;

source: in the *Clear the Server Cache of this layer* section the :guilabel:`Empty Tiled-Layer Cache` allows to wipe the tile-cache of this layer;
pt_pt: na secção *Limpar o cache do servidor desta camada* :guilabel:`Esvaziar o cache da camada de mosaico` permite limpar o cache de blocos desta camada;

source: the *About* section shows you the layer *Owner*, the *Contact* user and the *Metadata Author*.
pt_pt: a secção *Sobre* mostra a camada *Proprietário*, o usuário de *Contacto* e o *Autor de Metadados*.
