Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_layers/layer_permissions.po
Languages: pt_pt

source: Changing the Layer Permissions
pt_pt: Alterando as Permissões da Camada

source: When creating or uploading a new Layer you have to set who can view, download, edit and manage that Layer. By default only owners can edit and manage layers, anyone can view and download them.
pt_pt: Ao criar ou carregar uma nova Camada, tem de definir quem pode ver, transferir, editar e gerir essa Camada. Por padrão, apenas os proprietários podem editar e gerir camadas, qualquer um pode vê-las e descarregá-las.

source: In order to modify the Layer *Permissions* settings you have to click the :guilabel:`Change the Layer Permissions` button in the Layer page.
pt_pt: Para modificar as definições de *Permissões* da Camada tem de clicar no botão :guilabel:`Change the Layer Permissions` na página Camada.

source: *Change Layer Permissions*
pt_pt: *Alterar Permissões de Camada*

source: Through the *Permissions Settings Panel* you can add or remove permissions for users and groups. The picture below shows an example.
pt_pt: Através do Painel de Definições de *Permissões* pode adicionar ou remover permissões para utilizadores e grupos. A imagem abaixo mostra um exemplo.

source: *Layer Permissions settings for users and groups*
pt_pt: *Configurações de Permissões de Camada para utilizadores e grupos*

source: You can set the following types of permissions:
pt_pt: Você pode definir os seguintes tipos de permissões:

source: *View* allows to view the layer;
pt_pt: *Visualizar* permite ver a camada;

source: *Download* allows to download the layer;
pt_pt: *Baixar* permite baixar a camada;

source: *Change Metadata* allows to change the layer metadata;
pt_pt: *Alterar Metadados* permite alterar os metadados da camada;

source: *Edit Data* allows to change attributes and properties of the layers features;
pt_pt: *Editar Dados* permite alterar atributos e propriedades dos recursos das camadas;

source: *Edit Style* allows to change the layer style;
pt_pt: *Editar Estilo* permite alterar o estilo da camada;

source: *Manage* allows to update, delete, change permissions, publish and unpublish the layer.
pt_pt: *Gerir* permite actualizar, excluir, alterar permissões, publicar e cancelar a publicação da camada.

source: When assigning permissions to a group, all the group members will have those permissions. Be careful in case of editing permissions.
pt_pt: Ao atribuir permissões a um grupo, todos os membros do grupo terão essas permissões. Tenha cuidado no caso de editar permissões.

source: Click on :guilabel:`Apply Changes` to save these settings.
pt_pt: Clique em :guilabel:`Apply Changes` para guardar essas configurações.
