Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_layers/layer_styling.po
Languages: pt

source: Layer Styling
pt: Modelação de Camada

source: Maps are helpful because they allow you gain a deeper understanding of your data by allowing you to visualize it in many different ways. So you can tell different stories depending on how the data is presented. For any given data or layer, you should explore different styling options and choose the best style for that.
pt: Os mapas são úteis porque permitem obter uma compreensão mais profunda dos seus dados, permitindo-lhe visualizá-lo de muitas maneiras diferentes. Assim, pode contar histórias diferentes dependendo da forma como os dados são apresentados. Para qualquer dado ou camada, deve explorar diferentes opções de estilo e escolher o melhor estilo.

source: In GeoNode each layer has a *Default Style* which is determined by the nature of the data you're mapping. When uploading a new layer (see :ref:`uploading-layers`) a new default style will be associated to it.
pt: No GeoNode cada camada tem um *Estilo Predefinido* que é determinado pela natureza dos dados que está a mapear. Ao carregar uma nova camada (veja :ref:`uploading-layers`) será associado um novo estilo predefinido.

source: *Default Style for Layers*
pt: *Estilo Predefinido para Camadas*

source: Referring to the example above, dark orange lines are not very good to represent waterways so we would need to change this style. In the following paragraphs you will learn how to create a new style starting from given templates, how to edit a style, how to upload styles from file and how to manage them.
pt: Referindo-se ao exemplo acima, as linhas laranja escuras não são muito boas para representar as vias navegáveis, pelo que teríamos de mudar este estilo. Nos parágrafos seguintes, você irá aprender a criar um novo estilo a partir de modelos, como editar um estilo, como carregar estilos a partir de arquivos e como geri-los.

source: Creating new Styles
pt: Criação de novos Estilos

source: In order to create a new style, open the *Layer Page* (see :ref:`layer-info`) and click on :guilabel:`Editing Tools`. Then click the :guilabel:`Edit` button in the *Styles* section of the *Layer Editing* panel (see the picture below).
pt: Para criar um novo estilo, abra a *Página Camada* (veja :ref:`layer-info`) e clique em :guilabel:`Editing Tools`. Em seguida, clique no botão :guilabel:`Edit` na secção *Estilos* do painel *Edição de Camadas* (veja a imagem em baixo).

source: *Edit Styles button*
pt: *Botão Editar Estilos*

source: The *Layer* will open in a new *Map*. The *Styles Panel* will show you all the available styles for the layer and some useful tools.
pt: A *Camada* irá abrir num novo *Mapa*. O *Painel de Estilos* irá mostrar-lhe todos os estilos disponíveis para a camada e algumas ferramentas úteis.

source: *The Styles Panel in the Map*
pt: *O Painel de Estilos no Mapa*

source: Now follow the steps below:
pt: Agora siga os passos em baixo:

source: Click the |create_new_style_button| button. The *Style Templates Panel* will open.
pt: Clique no botão |create_new_style_button|. O *Painel de Modelos de Estilo* será aberto.

source: *Create new Styles*
pt: *Criar novos Estilos*

source: Choose a *Style Template* from the list (both *CSS* and *SLD* styles are available).
pt: Escolha um *Modelo de Estilo* na lista (os estilos *CSS* e *SLD* estão disponíveis).

source: *Style Templates*
pt: *Modelos de Estilo*

source: Click the |add_style_button| button to add the *Style Template* to the styles list.
pt: Clique no botão |add_style_button| para adicionar o *Modelo de Estilo* à lista de estilos.

source: Insert a *Title* and an *Abstract* (optional), then click on :guilabel:`Save`.
pt: Insira um *Título* e um *Resumo* (opcional), a seguir clique em :guilabel:`Save`.

source: *Title and Abstract for new Styles*
pt: *Título e Resumo para novos Estilos*

source: The style you have created is now added to the *Styles List*.
pt: O estilo que criou agora está adicionado à *Lista de Estilos*.

source: *New Styles into the list*
pt: *Novos Estilos para a lista*

source: You will also see this new style in the *Layer Page*.
pt: Poderá também, ver esse novo estilo na *Página de Camadas*.

source: *The Layer Page with the new Style*
pt: *A Página de Camadas com o novo estilo*

source: Now you can switch the style by clicking on the corresponding checkbox.
pt: Agora pode mudar o estilo clicando na caixa de selecção correspondente.

source: It would be nice to change the style in order to decrease the opacity of the filling color as well as to reduce the lines width. The embedded `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ makes available a powerful *Style Editor* to accomplish that tasks. In the next paragraph we will explain how.
pt: Seria bom alterar o estilo para diminuir a opacidade da cor de preenchimento, bem como para reduzir a largura das linhas. O `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ incorporado disponibiliza um poderoso *Editor de Estilos* para realizar essas tarefas. No próximo parágrafo, explicaremos como.

source: Editing the Layer Style
pt: Edição do Estilo de Camada

source: The following steps show you how to edit styles:
pt: As etapas a seguir mostram como editar estilos:

source: From inside the map open the *TOC (Table Of Content)* by clicking the |toc_button| button
pt: De dentro do mapa, abra a *TOC (Tabela de Conteúdos)* clicando no botão |toc_button|

source: Click on |layer_settings_button|
pt: Clique em |layer_settings_button|

source: Open the *Style* tab |style_tab|
pt: Abra a guia *Estilo* |style_tab|

source: Styles editing is allowed only to those users who have the needed permission. See :ref:`layer-permissions` to read more)
pt: A edição de estilos é permitida apenas para os utilizadores que possuem a permissão necessária. Veja :ref:`layer-permissions` para ler mais)

source: Select the *Style* and click on |style_editor_button|
pt: Seleccione o *Estilo* e clique em |style_editor_button|

source: Edit the style. The *Style Editor* helps you to write valid styles through the *Syntax Validator* which shows you a popup in case of errors (see the picture below).
pt: Edite o estilo. O *Editor de Estilos* ajuda a escrever estilos válidos por meio do *Validador de Sintaxe* que mostra um pop-up em caso de erros (veja a imagem em baixo).

source: *The Style Editor Syntax Validation*
pt: *Validação de Sintaxe do Editor de Estilos*

source: Click on |save_style_button| to save your changes.
pt: Clique em |save_style_button| para salvar as suas alterações.

source: See the following gif to recap the whole process.
pt: Veja o seguinte gif para recapitular todo o processo.

source: *The Style Editor*
pt: *O Editor de Estilos*

source: You can also decide to make your new style the *Default Style* of that layer. Click on |set_style_as_default_button| to do that.
pt: Pode, também, decidir tornar o seu novo estilo o *Estilo Padrão* dessa camada. Clique em |set_style_as_default_button| para fazer isso.

source: Click on |delete_style_button| to delete the style.
pt: Clique em |delete_style_button| para excluir o estilo.

source: Uploading Styles
pt: Carregamento de Estilos

source: In GeoNode it is also possible to upload an existing style from file.
pt: No GeoNode, é também possível carregar um estilo existente a partir de um arquivo.

source: Currently only styles in **SLD (Style Layer Descriptor 1.0, 1.1)** format can be uploaded in GeoNode.
pt: Actualmente, apenas estilos no formato **SLD (Style Layer Descriptor 1.0, 1.1)** podem ser carregados no GeoNode.

source: From the *Layer Page* click on *Editing Tools* to open the *Editing Tools* panel and follow the steps below:
pt: Da *Página de Camadas* clique em *Ferramentas de Edição* para abrir o painel *Ferramentas de Edição* e siga os passos abaixo:

source: Click the :guilabel:`Upload` button of the *Styles* section
pt: Clique no botão :guilabel:`Upload` da secção *Estilos*

source: *Upload Styles button*
pt: *Botão Carregar Estilos*

source: Click on :guilabel:`Choose Files` and select your style from your disk
pt: Clique em :guilabel:`Choose Files` e seleccione o seu estilo no disco

source: *Upload Styles*
pt: *Estilos de Upload*

source: Click on :guilabel:`Upload files`
pt: Clique em :guilabel:`Upload files`

source: Once the process has been finished the new *Style* will be visible in the *Layer Page*.
pt: Assim que o processo for concluído, o novo *Estilo* ficará visível na *Página de Camadas*.

source: Managing Styles
pt: Gestão de Estilos

source: Given a layer, you can manage all its styles in the *Styles Management Page* accessible from the :guilabel:`Manage` button of the *Layer Editing* panel.
pt: Dada uma camada, pode fazer a gestão de todos os seus estilos na *Página de Gestão de Estilos* acessível a partir do botão :guilabel:`Manage` do painel *Edição de Camadas*.

source: *Managing Styles*
pt: *Gestão de Estilos*

source: In that page you can:
pt: Nesta página, pode:

source: See the *Layer Name*
pt: Veja o *Nome da Camada*

source: Add/remove styles to/from the *Available styles* list
pt: Adicionar/remover estilos para/da lista *Estilos disponíveis*

source: Choose the *Layer Default Style* from the *Available styles* list
pt: Escolha o *Estilo Padrão da Camada* na lista *Estilos disponíveis*

source: Click on :guilabel:`Update Available Styles` to save your changes.
pt: Clique em :guilabel:`Update Available Styles` para salvar as suas alterações.
