Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_layers/layer_metadata.po
Languages: pt_pt

source: Layers Metadata
pt_pt: Metadados de Camadas

source: In GeoNode special importance is given to *Metadata* and their standard formats. You can explore the *Metadata* of a *Layer* by clicking the :guilabel:`Metadata Detail` button from the *Layer Page*.
pt_pt: No GeoNode é dada especial importância aos *Metadados* e seus formatos padrão. Você pode explorar os *Metadados* de uma *Camada* clicando no botão :guilabel:`Detalhe dos metadados` na *Página da Camada*.

source: *The Layer Metadata Detail button*
pt_pt: *O botão Detalhe da Camada de Metadados*

source: The *Layer Metadata* page will be displayed.
pt_pt: A página *Metadados da Camada* será exibida.

source: *The Layer Metadata Details*
pt_pt: *Os Detalhes de Metadados da Camada*

source: In that page you can see the whole set of available metadata about the layer. Metadata are grouped in order to show the following types of information:
pt_pt: Nessa página, você pode ver todo o conjunto de metadados disponíveis sobre a camada. Os metadados são agrupados para mostrar os seguintes tipos de informações:

source: *Identification* to uniquely identify the layer (Title, Abstract, Publication Date etc.);
pt_pt: *Identificação* para identificar de forma única a camada (Título, Resumo, Data de Publicação, etc.);

source: *Owner*, the user who owns the layer;
pt_pt: *Proprietário*, o usuário a quem pertence a camada;

source: *Information*, the Identification Image, the Spatial Extent, Projection System and so on;
pt_pt: *Informações*, a Imagem de Identificação, Extensão Espacial, Sistema de Projeção e assim por diante;

source: *Features*, Language, Supplemental and other Information;
pt_pt: *Recursos*, Idioma, Informações suplementares e outras Informações;

source: *Contact Points*, the available user to get in contact;
pt_pt: *Pontos de Contacto*, o usuário disponível para entrar em contacto;

source: *References*, various links to the resource information and data;
pt_pt: *Referências*, vários links para informações de recursos e dados;

source: *Metadata Author*, information about the author of the metadata.
pt_pt: *Autor dos Metadados*, informações sobre o autor dos metadados.

source: Downloading Metadata
pt_pt: Baixando Metadados

source: The :guilabel:`Download Metadata` button of the *Layer Page* allows you to download the layer metadata in various formats.
pt_pt: O botão :guilabel:`Baixar Metadados` da *Página da Camada* permite que você baixe os metadados da camada em vários formatos.

source: *How to Download Metadata*
pt_pt: *Como fazer Download de Metadados*

source: The available download formats are grouped in three categories:
pt_pt: Os formatos de download disponíveis estão agrupados em três categorias:

source: *Full metadata*
pt_pt: *Metadados completos*

source: *Standard Metadata - XML format*
pt_pt: *Metadados Padrão - formato XML*

source: *Attribute Information*
pt_pt: *Informação de Atributo*

source: Click on the format name that you prefer to start the download.
pt_pt: Clique no nome do formato de sua preferência para iniciar o download.

source: Metadata Wizard
pt_pt: Assistente de Metadados

source: Metadata contains all the information related to the layer. They provide essential information for its identification and its comprehension. Metadata also make the layer more easily retrievable through search by other users.
pt_pt: Os metadados contêm todas as informações relacionadas à camada. Eles fornecem informações essenciais para sua identificação e compreensão. Os metadados também tornam a camada mais facilmente recuperável por meio da pesquisa por outros usuários.

source: The *Metadata* of a layer can be changed through a *Wizard* which involves four steps, one for each type of metadata considered:
pt_pt: Os *Metadados* de uma camada podem ser alterados através de um *Assistente* que envolve quatro etapas, uma para cada tipo de metadado considerado:

source: **Basic Metadata**
pt_pt: **Metadados Básicos**

source: The first two steps are mandatory (no layers will be published if the required information are not provided) whereas the last two are optional.
pt_pt: As duas primeiras etapas são obrigatórias (nenhuma camada será publicada se as informações necessárias não forem fornecidas), enquanto as duas últimas são opcionais.

source: *Basic Layer Metadata*
pt_pt: *Metadados de Camada Básica*

source: In the first step the system asks you to insert the following metadata:
pt_pt: Na primeira etapa, o sistema pede que você insira os seguintes metadados:

source: The *Thumbnail* of the layer (click :guilabel:`Edit` to change it);
pt_pt: A *Miniatura* da camada (clique :guilabel:`Editar` para alterá-la);

source: The *Title* of the layer, which should be clear and understandable;
pt_pt: O *Título* da camada, que deve ser claro e compreensível;

source: An *Abstract*; brief narrative summary of the content of the Layer
pt_pt: Um *Resumo*; breve resumo narrativo do conteúdo da camada

source: The *Abstract* panel allows you to insert HTML code through a *wysiwyg* text editor
pt_pt: O painel *Resumo* permite inserir código HTML por meio de um editor de texto *wysiwyg*

source: The *Creation/Publication/Revision Dates* which define the time period that is covered by the layer;
pt_pt: As *Datas de Criação/Publicação/Revisão* que definem o período de tempo coberto pela camada;

source: The *Keywords*, which should be chosen within the available list. The contributor search for available keywords by clicking on the searching bar, or on the folder logo representing, or by entering the first letters of the desired word;
pt_pt: As *Palavras-Chave*, que devem ser escolhidas dentro da lista disponível. O colaborador busca as palavras-chave disponíveis clicando na barra de busca, ou no logotipo da pasta que representa, ou digitando as primeiras letras da palavra desejada;

source: The *Category* which the layer belongs to;
pt_pt: A *Categoria* à qual a camada pertence;

source: The *Group* which the layer is linked to.
pt_pt: O *Grupo* ao qual a camada está vinculada.

source: **Location and Licenses**
pt_pt: **Localização e Licenças**

source: *Location and Licenses Metadata for Layers*
pt_pt: *Localização e Metadados de Licenças para Camadas*

source: The following list shows what kinds of metadata you are required to enter (see also the picture below):
pt_pt: A lista a seguir mostra quais tipos de metadados você deve inserir (veja também a imagem abaixo):

source: The *Language* of the layer;
pt_pt: O *Idioma* da camada;

source: The *License* of the dataset;
pt_pt: A *Licença* do conjunto de dados;

source: The *DOI* of the dataset; if available, this represents the `Digital Object Identifier <https://www.doi.org/>`_ of the resource
pt_pt: O *DOI* do conjunto de dados; se disponível, representa o `Digital Object Identifier <https://www.doi.org/>` _ do recurso

source: The *Attribution* of the dataset; authority or function assigned, as to a ruler, legislative assembly, delegate, or the like
pt_pt: A *Atribuição* do conjunto de dados; autoridade ou função atribuída, como governante, assembleia legislativa, delegado ou semelhante

source: The *Regions*, which informs on the spatial extent covered by the layer. Proposed extents cover the following scales: global, continental, regional, national;
pt_pt: As *Regiões*, que informam sobre a extensão espacial coberta pela camada. As extensões propostas cobrem as seguintes escalas: global, continental, regional, nacional;

source: The *Data Quality statement* (general explanation of the data producer's knowledge about the lineage of a dataset);
pt_pt: A *Declaração de Qualidade de Dados* (explicação geral do conhecimento do produtor de dados sobre a linhagem de um conjunto de dados);

source: Potential *Restrictions* on layer sharing.
pt_pt: Potenciais *Restrições* no compartilhamento de camadas.

source: The *Data Quality statement* and *Restrictions* panels allow you to insert HTML code through a *wysiwyg* text editor
pt_pt: Os painéis *Declaração de Qualidade de Dados* e *Restrições* permitem inserir código HTML por meio de um editor de texto *wysiwyg*

source: **Optional Metadata**
pt_pt: **Metadados Opcionais**

source: *Optional Layer Metadata*
pt_pt: *Metadados de Camada Opcionais*

source: Complementary information are:
pt_pt: As informações complementares são:

source: The *Edition* to indicate the reference or the source of the layer;
pt_pt: A *Edição* para indicar a referência ou a origem da camada;

source: The *Purpose* of the layer and its objectives;
pt_pt: O *Propósito* da camada e seus objetivos;

source: Any *Supplemental information* that can provide a better understanding of the uploaded layer;
pt_pt: Qualquer *Informação Suplementar* que possa fornecer uma melhor compreensão da camada carregada;

source: The *Maintenance frequency* of the layer;
pt_pt: A *Frequência de Manutenção* da camada;

source: The users who are *Responsible* for the layer, its *Owner*, and the *Author* of its metadata;
pt_pt: Os usuários que são *Responsáveis* pela camada, seu *Proprietário* e o *Autor* de seus metadados;

source: The *Spatial representation type* used.
pt_pt: O *Tipo de representação espacial* usado.

source: The *Purpose* and *Supplemental information* panels allow you to insert HTML code through a *wysiwyg* text editor
pt_pt: Os painéis *Objectivo* e *Informações suplementares* permitem inserir código HTML por meio de um editor de texto *wysiwyg*

source: **Dataset Attributes**
pt_pt: **Atributos do Conjunto de Dados**

source: *Dataset Attributes Metadata for Layers*
pt_pt: *Metadados de Atributos do Conjunto de Dados para Camadas*

source: At this step you can enrich the dataset attributes with useful information like the following:
pt_pt: Nesta etapa, você pode enriquecer os atributos do conjunto de dados com informações úteis como as seguintes:

source: The *Label* displayed
pt_pt: O *Rótulo* exibido

source: A detailed *Description*
pt_pt: Uma *Descrição* detalhada

source: The *Display Order*
pt_pt: A *Ordem de Exibição*

source: The *Display Type*; the default value is *Label*, which means that the value of the attribute will be rendered as a plain text. There's the possibility to instruct GeoNode to threat the values as different media-types. As an instance, if the values of the selected attribute will contain image urls, by selecting the ``IMAGE`` *Display Type* you will allow GeoNode to render the image directly when querying the layer from the maps. The same for ``VIDEO``, ``AUDIO`` or ``IFRAME`` mime types.
pt_pt: O *Tipo de Exibição*; o valor padrão é *Rótulo*, o que significa que o valor do atributo será renderizado como um texto simples. Existe a possibilidade de instruir GeoNode a ameaçar os valores como diferentes tipos de mídia. Por exemplo, se os valores do atributo seleccionado irão conter urls de imagem, seleccionando `` IMAGE`` *Tipo de Exibição* você permitirá que GeoNode renderize a imagem directamente ao consultar a camada dos mapas. O mesmo para os tipos MIME ``VIDEO``, ``AUDIO`` ou ``IFRAME``.

source: The *Visibile* flag; allows you to instruct GeoNode wether or not hiding an attribute from the *Get Feature Type* outcomes
pt_pt: O sinalizador *Visível*; permite que você instrua o GeoNode a ocultar ou não um atributo dos resultados de *Obter Tipo de Recurso*

source: It is possible to define a completely custom ``HTML`` template for the *Get Feature Type* outcome. That is possible by enabling the *Use a custom template* flag as shown in the figure below.
pt_pt: É possível definir um template ``HTML`` completamente customizado para o resultado *Obter Tipo de Recurso*. Isso é possível activando o sinalizador *Usar um modelo personalizado* conforme mostrado na figura abaixo.

source: *Use a custom template*
pt_pt: *Use um modelo personalizado*

source: By using the keywork ``${properties.<attribute_name>``, you can tell to GeoNode to render the actual value of the attribute on the map.
pt_pt: Usando o keywork ``$ {properties.<attribute_name>``, você pode dizer ao GeoNode para renderizar o valor real do atributo no mapa.

source: As an instance, the example below
pt_pt: Como uma instância, o exemplo abaixo

source: *Use a custom template: HTML*
pt_pt: *Use um modelo personalizado: HTML*

source: Will render an ``HTML Table`` along with values as shown here below
pt_pt: Irá renderizar uma ``Tabela HTML`` junto com os valores mostrados aqui abaixo

source: *Use a custom template: Get Feature Info outcome*
pt_pt: *Use um modelo personalizado: Obtenha Resultados de Informações sobre o Recurso*

source: Use :guilabel:`next >>` or :guilabel:`<< back` to navigate through those steps. Once you have finished click on :guilabel:`Update`.
pt_pt: Use :guilabel:`próximo >>` ou :guilabel:`<< voltar` para navegar por essas etapas. Assim que terminar, clique em :guilabel:`Actualizar`.

source: Some metadata are mandatory, if you miss any of that metadata the *Completeness* bar shows you a red message like the one in the picture below.
pt_pt: Alguns metadados são obrigatórios, se você perder algum desses metadados, a barra *Completude* mostra uma mensagem em vermelho como a da imagem abaixo.

source: *Completeness Progress Bar*
pt_pt: *Barra de Progresso de Completude*

source: Metadata Advanced Editing
pt_pt: Edição Avançada de Metadados

source: In the *Layer Editing* panel the :guilabel:`Advanced Edit` is also available.
pt_pt: No painel *Edição de Camadas* o :guilabel:`Edição Avançada` também está disponível.

source: *The Advanced Edit button*
pt_pt: *O botão de Edição Avançada*

source: Click on it to display the *Metadata Advanced Editing Page*. That page allows you to edit all the layer metadata described in the previous paragraph. Once you have finished to edit them click on :guilabel:`Update` to save your changes.
pt_pt: Clique nele para exibir a *Página de Edição Avançada de Metadados*. Essa página permite que você edite todos os metadados da camada descritos no parágrafo anterior. Assim que terminar de editá-los, clique em :guilabel:`Actualizar` para salvar suas alterações.

source: Uploading Metadata
pt_pt: Carregando Metadados

source: Users may also upload a metadata XML document (in ISO, FGDC, or Dublin Core format) to fill in key GeoNode metadata elements automatically. The picture below shows you how the page looks like.
pt_pt: Os usuários também podem fazer upload de um documento XML de metadados (em formato ISO, FGDC ou Dublin Core) para preencher os principais elementos de metadados do GeoNode automaticamente. A imagem abaixo mostra a aparência da página.

source: *The Metadata Advanced Editing page*
pt_pt: *A página de Edição Avançada de Metadados*

source: Click on :guilabel:`Choose Files` to select the document from your disk, then click on :guilabel:`Upload files` to trigger the uploading process.
pt_pt: Clique em :guilabel:`Seleccionar Ficheiros` para seleccionar o documento do seu disco, em seguida clique em :guilabel:`Carregar ficheiros` para iniciar o processo de upload.
