Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_layers/layer_editing.po
Languages: pt

source: Layer Editing
pt: Edição de Camada

source: The :guilabel:`Editing Tools` button of the *Layer Page* (see :ref:`layer-info`) opens a panel like the one shown in the picture below.
pt: O botão :guilabel:`Editing Tools` da *Página Camada* (veja :ref:`layer-info`) abre um painel como o mostrado na imagem em baixo.

source: *The Layer Editing panel*
pt: *O painel de Edição de Camadas*

source: In that panel you can see many options grouped by four categories:
pt: Neste painel, pode ver muitas opções agrupadas por quatro categorias:

source: *Metadata*
pt: *Metadados*

source: *Styles*
pt: *Estilos*

source: *Thumbnail*
pt: *Miniatura*

source: *Layer*
pt: *Camada*

source: In this section you will learn how to edit a *Layer*, how to replace and edit its data. See :ref:`layer-metadata` to learn how to explore the layer *Metadata*, how to upload and edit them. The *Styles* will be covered in a dedicated section, see :ref:`layer-style`.
pt: Nesta secção, aprenderá como editar uma *Camada*, como substituir e editar os seus dados. Veja :ref:`layer-metadata` para aprender como explorar a camada *Metadados*, como carregá-los e editá-los. Os *Estilos* serão abordados em uma secção dedicada, consulte :ref:`layer-style`.

source: Setting the Layer Thumbnail
pt: Configurando a Miniatura da Camada

source: The Thumbnail of the layer that will be displayed on the *Layers* list page can be changed by dragging and zooming on the layer preview to select which portion will be displayed, then by clicking on the :guilabel:`Set` button of the *Layer Editing* panel.
pt: A Miniatura da camada que será exibida na página de lista de *Camadas* pode ser alterada arrastando e ampliando a visualização da camada para seleccionar qual parte será exibida e, em seguida, clicando no botão :guilabel:`Set` do *Painel de Edição de Camadas*.

source: A message will confirm the thumbnail has been correctly changed.
pt: Uma mensagem confirmará que a miniatura foi alterada correctamente.

source: It is also possible to manually upload a thumbnail by using the :guilabel:`Upload` button of the *Layer Editing* panel. Using the "Upload Thumbnail" page it is possible to enable the automatically generated thumbnail or upload an image to be used in place of it.
pt: É também possível carregar manualmente uma miniatura usando o botão :guilabel:`Upload` do painel *Edição de Camadas*. Usando a página "Carregar Miniatura", é possível habilitar a miniatura gerada automaticamente ou carregar uma imagem para ser usada no lugar dela.

source: *The Upload Thumbnail panel*
pt: *O painel Carregar Miniatura*

source: Replacing the Layer
pt: Substituindo a Camada

source: From the *Layer Editing* panel click on :guilabel:`Replace` to change the layer source dataset. You will be driven to the *Replace Layer* page in which :guilabel:`Choose Files` button allows you to select files from your disk.
pt: No painel *Edição de Camada*, clique em: guilabel:`Replace` para alterar o conjunto de dados de origem da camada. Será direccionado para a página *Substituir Camada* na qual o botão :guilabel:`Choose Files` permite que seleccione arquivos do seu disco.

source: *Replace a Layer*
pt: *Substituir uma Camada*

source: Once the *Charset* selected the upload process can be triggered by clicking on :guilabel:`Replace Layer`. If no errors occur you will see a message like the one in the picture below.
pt: Assim que o *Charset* for seleccionado, o processo de upload pode ser accionado clicando em :guilabel:`Replace Layer`. Se nenhum erro ocorrer, irá ver uma mensagem como a da imagem em baixo.

source: *Replace Layer success*
pt: *Sucesso na Substituição da Camada*

source: We have replaced the *roads* dataset with the *railways* one. You can see the differences in the *Layer Preview*.
pt: Substituímos o conjunto de dados *estradas* pelo conjunto de *ferrovias*. Pode ver as diferenças na *Pré-visualização da Camada*.

source: *Result of the Layer Replacement*
pt: *Resultado da Substituição da Camada*

source: Append Data to Layer
pt: Anexar Dados à Camada

source: From the *Layer Editing* panel click on :guilabel:`Append` to append data to the layer source dataset. You will be driven to the *Append Layer* page in which :guilabel:`Choose Files` button allows you to select files from your disk.
pt: No painel *Edição de Camada*, clique em :guilabel:`Append` para anexar dados ao conjunto de dados de origem da camada. Será direccionado para a página *Anexar Camada* na qual o botão :guilabel:`Choose Files` permite que seleccione arquivos do seu disco.

source: *Append to a Layer*
pt: *Anexar a uma Camada*

source: Once the *Charset* selected the upload process can be triggered by clicking on :guilabel:`Append to Layer`. If no errors occur you will see a message like the one in the picture below.
pt: Uma vez selecionado o *Charset*, o processo de upload pode ser accionado clicando em :guilabel:`Append to Layer`. Se nenhum erro ocorrer, irá ver uma mensagem como a da imagem em baixo.

source: We have append the *layer_name* dataset to the existing one. You can see the differences in the *Layer Preview*.
pt: Anexamos o dataset *nome_da_camada* ao existente. Pode ver as diferenças na *Pré-visualização da Camada*.

source: Editing the Layer Data
pt: Editando os Dados da Camada

source: The :guilabel:`Edit data` button of the *Layer Editing* panel opens the *Layer* within a *Map*.
pt: O botão :guilabel:`Edit data` do painel *Edição de Camadas* abre a *Camada* dentro de um *Mapa*.

source: *Editing the Layer Data*
pt: *Editando os Dados da Camada*

source: The *Attribute Table* panel of the *Layer* will automatically appear at the bottom of the *Map*. In that panel all the features are listed. For each feature you can zoom to its extent by clicking on the corresponding *magnifying glass* icon |magnifying_glass_icon| at the beginning of the row, you can also observe which values the feature assumes for each attribute.
pt: O painel *Tabela de Atributos* da *Camada* irá aparecer automaticamente na parte inferior do *Mapa*. Neste painel, todos os recursos são listados. Para cada recurso, pode aumentar o zoom clicando no ícone da *lupa* correspondente |magnifying_glass_icon| no início da linha, pode também observar quais valores o recurso assume para cada atributo.

source: Click the *Edit Mode* |edit_mode_button| button to start an editing session.
pt: Clique no botão *Modo de Edição* |edit_mode_button| botão para iniciar uma sessão de edição.

source: Now you can:
pt: Agora pode:

source: *Add new Features*
pt: *Adicionar novos Recursos*

source: Through the *Add New Feature* button |add_new_feature_button| it is possible to set up a new feature for your layer. Fill the attributes fields and click |save_changes_button| to save your change. Your new feature doesn't have a shape yet, click on |add_shape_to_geometry_button| to draw its shape directly on the *Map* then click on |save_changes_button| to save it.
pt: Através do botão *Adicionar Novo Recurso* |add_new_feature_button| é possível configurar um novo recurso para a sua camada. Preencha os campos de atributos e clique em |save_changes_button| para salvar a sua alteração. O seu novo recurso ainda não tem geometria, clique em |add_shape_to_geometry_button| para desenhar a sua forma directamente no *Mapa* e clique em |save_changes_button| para guardá-lo.

source: *Add a New Feature to the Layer*
pt: *Adicione um Novo Recurso à Camada*

source: When your new feature has a multi-vertex shape you have to double-click the last vertex to finish the drawing.
pt: Quando o novo recurso tem uma forma com vários vértices, deve clicar duas vezes no último vértice para finalizar o desenho.

source: *Delete Features*
pt: *Excluir Recursos*

source: If you want to delete a feature you have to select it on the *Attribute Table* and click on |delete_feature_button|.
pt: Se deseja excluir um elemento, deve selecioná-lo na *Tabela de Atributos* e clicar em |delete_feature_button|.

source: *Delete a Feature*
pt: *Excluir um Recurso*

source: *Change the Feature Shape*
pt: *Alterar o Formato do Recurso*

source: You can edit the shape of an existing geometry dragging its vertices with the mouse. A blue circle lets you know what vertex you are moving.
pt: Pode editar a forma de uma geometria existente arrastando os seus vértices com o rato. Um círculo azul permite que saiba qual o vértice que está a mover.

source: *Feature Shape Editing - Change the existing shape*
pt: *Edição de Forma de Recurso - Alterar a forma existente*

source: Features can have *multipart shapes*. You can add parts to the shape when editing it.
pt: Os recursos podem ter *formas com várias partes*. Pode adicionar partes à forma ao editá-la.

source: *Feature Shape Editing - Add parts to the existing shape*
pt: *Edição de Forma de Recurso - Adicionar peças à forma existente*

source: *Change the Feature Attributes*
pt: *Altere os Atributos do Recurso*

source: When you are in *Edit Mode* you can also edit the attributes values changing them directly in the corresponding text fields.
pt: Quando está no *Modo de Edição*, também pode editar os valores dos atributos, alterando-os directamente nos campos de texto correspondentes.

source: *Feature Attributes Editing*
pt: *Edição de Atributos do Recurso*

source: Once you have finished you can end the *Editing Session* by clicking on the |end_editing_session_button| button.
pt: Assim que terminar, pode encerrar a *Sessão de Edição* clicando no botão |end_editing_session_button|.

source: By default the GeoNode map viewer is `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ based, see the `MapStore Documentation <https://mapstore2.readthedocs.io/en/latest/>`_ for further information.
pt: Por padrão, o visualizador de mapa GeoNode é baseado em `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_, consulte a `Documentação MapStore <https://mapstore2.readthedocs.io/en/latest />`_ para mais informações.
