Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_layers/new_layer_from_scratch.po
Languages: pt_pt

source: Creating a Layer from scratch
pt_pt: Criação de uma camada do zero

source: An interesting tool that GeoNode makes available to you is the *Create Layer*. It allows you to create a new vector layer from scratch. The *Layer Creation Form* is reachable through the :guilabel:`Create Layer` link shown in the picture below.
pt_pt: Uma ferramenta interessante que o GeoNode disponibiliza para si é a *Criar Camada*. Permite criar uma nova camada vectorial do zero. O *Formulário de Criação de Camada* é alcançável através do link :guilabel:`Create Layer` mostrado na imagem abaixo.

source: *Create layer link*
pt_pt: *Link criar camada*

source: In order to create the new Layer you have to fill out the required fields:
pt_pt: Para criar a nova Camada tem de preencher os campos necessários:

source: *Name*
pt_pt: *Nome*

source: *Title*
pt_pt: *Título*

source: *Geometry type*
pt_pt: *Tipo de geometria*

source: *Geometry types*
pt_pt: *Tipos de geometria*

source: Usually the layers features should have some *Attributes* that enrich the amount of information associated with each of them. Through the :guilabel:`Add Attribute` button you can add new attributes.
pt_pt: Normalmente, as características das camadas devem ter alguns *Atributos* que enriquecem a quantidade de informação associada a cada uma delas. Através do botão :guilabel:`Add Attribute` pode adicionar novos atributos.

source: *New Layer creation from scratch*
pt_pt: *Criação de Camada Nova do zero*

source: At this time you can also change the default *Permissions* settings, see :ref:`layer-permissions` to learn how.
pt_pt: Neste momento, você pode também, alterar as configurações padrão de *Permissões*, consulte :ref:`permissões-de-camada` para saber como.

source: Once the form has been filled out, click on :guilabel:`Create`. You will be redirected to the *Layer Page* (see :ref:`layer-info`). Now your Layer is created but is still empty, no features have been added yet. See the :ref:`layer-editing` section to learn how to add new features.
pt_pt: Uma vez preenchido o formulário, clique em :guilabel:`Create`. Você será redireccionado para a *Página de Camadas* (veja :ref:`layer-info`). Agora a sua camada foi criada, mas ainda está vazia, nenhum recurso foi adicionado ainda. Veja a secção :ref:`layer-editing` para aprender como adicionar novos recursos.
