Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_layers/uploading_layers.po
Languages: pt_pt

source: Layers Uploading
pt_pt: Upload de Camadas

source: The most important resource type in GeoNode is the *Layer*. A layer represents spatial information so it can be displayed inside a map.
pt_pt: O tipo de recurso mais importante no GeoNode é a *Camada*. Uma camada representa informações espaciais para que possam ser exibidas dentro de um mapa.

source: To better understand what we are talking about lets upload your first layer.
pt_pt: Para entender melhor do que estamos a falar, vamos carregar a sua primeira camada.

source: The *Layer Uploading* page can be reached from the :guilabel:`Upload Layer` link of the :guilabel:`Data` menu in the navigation bar.
pt_pt: A página de *Carregamento de Camada* pode ser acessada a partir do link :guilabel:`Upload Layer` do menu :guilabel:`Data` na barra de navegação.

source: *Link for Layers Uploading*
pt_pt: *Link para Carregar Camadas*

source: There is also an :guilabel:`Upload Layers` button in the *Layers Page*.
pt_pt: Há também um botão :guilabel:`Upload Layers` na *Página de Camadas*.

source: *Button for Layers Uploading*
pt_pt: *Botão para Carregamento de Camadas*

source: The *Layers Uploading* page looks like the one in the picture below.
pt_pt: A página *Carregamento de Camadas* se parece com a da imagem abaixo.

source: *The Layers Uploading page*
pt_pt: *A página de Carregamento de Camadas*

source: Through the :guilabel:`Choose Files` button you can select files from your disk, make sure they are valid raster or vector spatial data. You can also change the default *Permissions* settings (see :ref:`layer-permissions` for further information on how to set permissions).
pt_pt: Através do botão :guilabel:`Choose Files` pode seleccionar ficheiros do seu disco, certifique-se de que são dados espaciais raster ou vectores válidos. Pode também, alterar as definições de *Permissões* predefinidas (veja :ref:`layer-permissions` para obter mais informações sobre como definir permissões).

source: Select the *charset*, then click on :guilabel:`Upload files` to start the process or click :guilabel:`Clear` to remove all the loaded files form the page.
pt_pt: Selecione o *charset* e clique em :guilabel:`Upload files` para iniciar o processo ou clique em :guilabel:`Clear` para remover todos os arquivos carregados da página.

source: *Shapefile Uploading*
pt_pt: *Carregamento de Shapefile*

source: In this example the ``roads`` ESRI Shapefile, with all its mandatory files (`.shp`, `.shx`, `.dbf` and `.prj`), has been chosen. A progress bar shows the operation made during the layer upload and alerts you when the process is over. When the process ends click the :guilabel:`Layer Info` to check the layer has been correctly uploaded.
pt_pt: Neste exemplo, o Shapefile ESRI ``roads``, com todos os seus arquivos obrigatórios (`.shp`, `.shx`, `.dbf` e `.prj`), foi escolhido. Uma barra de progresso mostra a operação feita durante o upload da camada e alerta quando o processo termina. Quando o processo terminar, clique em :guilabel:`Layer Info` para verificar se a camada foi carregada correctamente.

source: There are lot of free spatial dataset available in the Internet. In this example, an extract of the Berlin city center roads map from the `BBBike extracts OpenStreetMap <https://extract.bbbike.org>`_ dataset has been used.
pt_pt: Existem muitos conjuntos de dados espaciais gratuitos disponíveis na Internet. Neste exemplo, um extracto do mapa das estradas do centro da cidade de Berlim do conjunto de dados `BBBike extract OpenStreetMap <https://extract.bbbike.org>`_ foi usado.

source: In the next paragraphs you will learn how to create a layer from scratch, how to set permissions, how to explore the layer properties and how to edit them.
pt_pt: Nos próximos parágrafos, você aprenderá como criar uma camada do zero, como definir permissões, como explorar as propriedades da camada e como editá-las.
