Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_layers/using_remote_services.po
Languages: pt_pt

source: Using Remote Services
pt_pt: Usando Serviços Remotos

source: In GeoNode you can add new layers not only by loading them from your disk but also using *Remote Services*. In this section you will learn how to add a new service and how to load resources in GeoNode through that.
pt_pt: No GeoNode você pode adicionar novas camadas não apenas carregando-as do seu disco, mas também usando *Serviços Remotos*. Nesta secção, você aprenderá como adicionar um novo serviço e como carregar recursos no GeoNode através dele.

source: Let's try it!
pt_pt: Vamos experimentar!

source: Click on the :guilabel:`Remote Services` link of the :guilabel:`Data` menu in the navigation bar.
pt_pt: Clique no link :guilabel:`Serviços Remotos` do menu :guilabel:`Dados` na barra de navegação.

source: *Remote Services link*
pt_pt: *Link de Serviços Remotos*

source: The page that opens will contain the list of the available services.
pt_pt: A página que se abre irá conter a lista dos serviços disponíveis.

source: *Remote Services*
pt_pt: *Serviços Remotos*

source: To configure a new service:
pt_pt: Para configurar um novo serviço:

source: click on :guilabel:`Register a new Service`
pt_pt: clique em :guilabel:`Registar um novo Serviço`

source: type the *Service URL*
pt_pt: digite o *URL do Serviço*

source: select the *Service Type*
pt_pt: seleccione o *Tipo de Serviço*

source: *Service Types*
pt_pt: *Tipos de Serviço*

source: click on :guilabel:`Create`
pt_pt: clique em :guilabel:`Criar`

source: GeoNode supports three **types of remote services**:
pt_pt: O GeoNode oferece suporte a três **tipos de serviços remotos**:

source: *Web Map Service*
pt_pt: *Serviço de Mapas da Web*

source: Generic Web Map Service (WMS) based on a standard protocol for serving georeferenced map images over the Internet. These images are typically produced by a map server (like `GeoServer <http://geoserver.org/>`_) from data provided by one or more distributed geospatial databases. Common operations performed by a WMS service are: *GetCapabilities* (to retrieves metadata about the service, including supported operations and parameters, and a list of the available layers) and *GetMap* (to retrieves a map image for a specified area and content).
pt_pt: Serviço Web Genérico de Mapas (WMS) baseado em um protocolo padrão para servir imagens de mapas georreferenciados pela Internet. Essas imagens são normalmente produzidas por um servidor de mapas (como `GeoServer <http://geoserver.org/>`_) a partir de dados fornecidos por um ou mais bancos de dados geoespaciais distribuídos. As operações comuns realizadas por um serviço WMS são: *GetCapabilities* (para recuperar metadados sobre o serviço, incluindo operações e parâmetros suportados e uma lista das camadas disponíveis) e *GetMap* (para recuperar uma imagem de mapa para uma área e conteúdo especificados)

source: Lots of WMS services are available on the internet, in this example we used the ``https://demo.geo-solutions.it/geoserver/wms``.
pt_pt: Muitos serviços WMS estão disponíveis na internet, neste exemplo usamos o ``https://demo.geo-solutions.it/geoserver/wms``.

source: *GeoNode Web Map Service*
pt_pt: *Serviço Web de Mapas do GeoNode*

source: Generally a WMS is not directly invoked; client applications such as GIS-Desktop or WEB-GIS are used that provide the user with interactive controls. A GeoNode WMS automatically performs some operations and lets you to immediately retrieve resources.
pt_pt: Geralmente, um WMS não é invocado directamente; aplicativos cliente, como GIS-Desktop ou WEB-GIS, são usados para fornecer ao usuário controles interactivos. Um WMS GeoNode executa automaticamente algumas operações e permite que você obtenha recursos imediatamente.

source: An example of GeoNode WMS is available at ``http://dev.geonode.geo-solutions.it/geoserver/wms``.
pt_pt: Um exemplo de WMS GeoNode está disponível em ``http://dev.geonode.geo-solutions.it/geoserver/wms``.

source: This map service provides basic information about the map, including the layers that it contains, whether the map is cached or not, its spatial reference, initial and full extents, whether the service is allowed to export tiles and max tiles export count, etc. A set of operations that manage the state and contents of the service are allowed: Edit Service, Refresh, Update Tiles. The URL should follow this pattern: ``https://<servicecatalog-url>/services/<serviceName>/MapServer``.
pt_pt: Este serviço de mapas fornece informações básicas sobre o mapa, incluindo as camadas que ele contém, se o mapa está armazenado em cache ou não, sua referência espacial, extensões iniciais e completas, se o serviço tem permissão para exportar blocos e contagem máxima de exportação de blocos etc. Um conjunto de operações que fazem a gestão do estado e do conteúdo do serviço é permitido: Editar serviço, Actualizar, Actualizar blocos. A URL deve seguir este padrão: ``https://<servicecatalog-url>/serviços/<serviceName>/MapServer``.

source: Try the following service to better understand how it works: ``https://sampleserver6.arcgisonline.com/arcgis/rest/services/USA/MapServer``.
pt_pt: Experimente o seguinte serviço para entender melhor como ele funciona: `` https://sampleserver6.arcgisonline.com/arcgis/rest/services/USA/MapServer``.

source: Once the service has been configured, you can load the resources you are interested in through the *Import Resources* page where you will be automatically redirected to. Take a look at the gif below to see the whole process.
pt_pt: Depois de configurar o serviço, você pode carregar os recursos de seu interesse por meio da página *Importar Recursos*, para a qual será redirecionado automaticamente. Dê uma olhada no gif abaixo para ver todo o processo.

source: *A new Remote Service*
pt_pt: *Um novo Serviço Remoto*

source: From the page where the services are listed, it is possible to click on the *Title* of a service. It opens the *Service Details* page.
pt_pt: Na página onde estão listados os serviços, é possível clicar no *Título* de um serviço. Ele abre a página de *Detalhes do Serviço*.

source: Each service has its own metadata such as the *Service Type*, the *URL*, an *Abstract*, some *Keywords* and the *Contact* user. You can edit those metadata through the form available from the :guilabel:`Edit Service Metadata` button of the *Service Details* page (see the picture below).
pt_pt: Cada serviço tem seus próprios metadados, como *Tipo de Serviço*, *URL*, um *Resumo*, algumas *Palavras-chave* e o usuário de *Contacto*. Você pode editar esses metadados através do formulário disponível no botão :guilabel:`Editar Metadados de Serviço` da página *Detalhes do Serviço* (veja a imagem abaixo).

source: *Remote Service metadata*
pt_pt: *Metadados de Serviço Remoto*
