Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/accounts_user_profile/new_account/index.po
Languages: pt_pt

source: Creating a New Account
pt_pt: Criação de uma Nova Conta

source: To take full advantage of all the GeoNode features you need an user account. Follow these step to create a new one.
pt_pt: Para tirar o máximo proveito de todos os recursos do GeoNode, você precisa de uma conta de utilizador. Siga estes passos para criar uma nova conta.

source: From any page in the web interface, you will see a :guilabel:`Register` link. Click that link, and the register form will appear
pt_pt: Em qualquer página da interface da web, você verá um link :guilabel:`Register`. Clique nesse link e o formulário de registo irá aparecer

source: The registrations in GeoNode must be open, in case you don't see the register link then it's not possible to register unless the administrator of the site does that for you.
pt_pt: Os registos no GeoNode devem ser abertos, caso não veja o link de registo, então não é possível se registar a menos que o administrador do site o faça para si.

source: *Sign in screen*
pt_pt: *Tela de login*

source: On the next page, fill out the form. Enter a user name and password in the fields. Also, enter your email address for verification.
pt_pt: Na próxima página, preencha o formulário. Insira um nome de utilizador e senha nos campos. Além disso, insira seu endereço de e-mail para verificação.

source: *Registering for a new account*
pt_pt: *Registando-se para uma nova conta*

source: You will be automatically logged in and redirected to the Profile page. An email will be sent confirming that you have signed up. If no errors occur during the registration, the following alerts will appear on the screen:
pt_pt: Você será automaticamente conectado e redireccionado para a página de Perfil. Um e-mail será enviado a confirmar a sua inscrição. Se nenhum erro ocorrer durante o registo, os seguintes alertas irão aparecer na tela:

source: *Alerts*
pt_pt: *Alertas*

source: To logout click on the :guilabel:`Log out` link of the user menu.
pt_pt: Para sair, clique no link :guilabel:`Log out` do menu do utilizador.

source: *Logout link*
pt_pt: *Link de logout*

source: You have to confirm this action as described in the picture below.
pt_pt: Você deve confirmar esta acção conforme descrito na imagem abaixo.

source: *Confirm Log out*
pt_pt: *Confirmar Log out*
