Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/creating_maps.po
Languages: pt_pt

source: Creating Maps
pt_pt: Criação de Mapas

source: In this section, we’ll create a *Map* using some uploaded layers, combine them with some other layers from remote web services, and then share the resulting map for public viewing.
pt_pt: Nesta secção, vamos criar um *Mapa* usando algumas camadas carregadas, combiná-las com algumas outras camadas de serviços remotos da web e, em seguida, partilhar o mapa resultante para visualização pública.

source: In order to create new maps you can use:
pt_pt: Para criar novos mapas pode utilizar:

source: the :guilabel:`Create Map` link of the *Maps* menu in the navigation bar
pt_pt: o link :guilabel:`Create Map` do menu *Maps* na barra de navegação

source: *The Create Map link*
pt_pt: *O link Criar Mapa*

source: the :guilabel:`Create Map` button in the *Layer Page* (it creates a map using a specific layer)
pt_pt: o botão :guilabel:`Create Map` na *Página de Camadas* (cria um mapa usando uma camada específica)

source: *The Create Map button*
pt_pt: *O botão Criar Mapa*

source: the :guilabel:`Create New Map` button in the *Explore Maps* page
pt_pt: o botão :guilabel:`Create New Map` na página *Explorar Mapas*

source: *The Create New Map button*
pt_pt: *O botão Criar Novo Mapa*

source: The new *Map* will open in a *Map Viewer* like the one in the picture below.
pt_pt: O novo *Mapa* será aberto em um *Visualizador de Mapas* como o da imagem em baixo.

source: *The Map Viewer*
pt_pt: *O Visualizador de Mapas*

source: In the upper left corner the |toc_button| button opens the :ref:`toc` of the *Map*. It allows to manage all the layers associated with the map and to add new ones from the *Catalog*.
pt_pt: No canto superior esquerdo, o botão |toc_button| abre o :ref:`toc` do *Mapa*. Permite gerir todas as camadas associadas ao mapa e adicionar novas a partir do *Catálogo*.

source: The *TOC* component makes possible to manage layers overlap on the map by shifting their relative positions in the list (drag and drop them up or down in the list).
pt_pt: O componente *TOC* torna possível gerir a sobreposição de camadas no mapa, mudando suas posições relativas na lista (arraste e solte-as para cima ou para baixo na lista).

source: It also allows to hide/show layers ( |show_button| and |hide_button| ), to zoom to layers extents ( |zoom_to_layer_extent_button| ) and to manage their properties ( |layer_settings_button| ).
pt_pt: Também permite ocultar/mostrar camadas ( |show_button| e |hide_button|), ampliar as extensões das camadas (|zoom_to_layer_extent_button|) e gerir suas propriedades (|layer_settings_button|).

source: Once the map layers have been settled it is possible to save the *Map* by clicking on |burger_menu_button| and choosing :guilabel:`Save as`.
pt_pt: Uma vez que as camadas do mapa foram definidas, é possível salvar o *Mapa* clicando em |burger_menu_button| e escolhendo :guilabel:`Save as`.

source: *Creating new Maps*
pt_pt: *Criação de novos Mapas*

source: If you followed the steps above, you have just created your first *Map*. Now you should see it in the *Explore Maps* page, see :ref:`map-info` for further details.
pt_pt: Se seguiu as etapas acima, acabou de criar o seu primeiro *Mapa*. Agora deve vê-lo na página *Explorar Mapas*, consulte :ref:`map-info` para mais detalhes.

source: We will take a closer look at the *Map Viewer* tools in the :ref:`exploring-maps` section.
pt_pt: Vamos verificar com mais detalhe as ferramentas do *Visualizador de Mapas* na secção :ref:`exploring-maps`.
