Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/map_info.po
Languages: pt_pt

source: Map Information
pt_pt: Informação do Mapa

source: As mentioned in the :ref:`finding-maps` section, in GeoNode you can see your maps and all the published maps through the :guilabel:`Explore Maps` link of the navigation bar.
pt_pt: Conforme mencionado na secção :ref:`finding-maps`, no GeoNode você pode ver seus mapas e todos os mapas publicados através do link :guilabel:`Explore Maps` da barra de navegação.

source: Click on the title of the *Map* you are interested in to open its *Information* page, it should looks like the following.
pt_pt: Clique no título do *Mapa* do seu interesse para abrir sua página de *Informações*, que deve ser semelhante a esta.

source: *The Map Information page*
pt_pt: *A página de Informações do Mapa*

source: The *Map Page* is divided into three main sections:
pt_pt: A *Página do Mapa* está dividida em três secções principais:

source: the *Map Preview* section, under the title
pt_pt: a seção *Pré-visualização do Mapa*, sob o título

source: the *Tabs* section, under the layer preview
pt_pt: a seção *Guias*, sob a pré-visualização da camada

source: the *Tools* section, on the right side of the page
pt_pt: a secção *Ferramentas*, no lado direito da página

source: Map Preview
pt_pt: Pré-visualização do Mapa

source: The *Map Preview* shows the *Map* with very basic functionalities:
pt_pt: A *Pré-visualização do Mapa* mostra o *Mapa* com funcionalidades muito básicas:

source: the *Base Map Switcher* that allows you to change the base map;
pt_pt: o *Comutador de Mapa Básico* que permite alterar o mapa básico;

source: the *Zoom in/out* tool to enlarge and decrease the view;
pt_pt: a ferramenta *Zoom in/out* para ampliar e diminuir a visualização;

source: the *Zoom to max extent* tool for the zoom to fit the layers extents;
pt_pt: a ferramenta *Zoom na extensão máxima* para que o zoom se ajuste ao tamanho da camada;

source: the *Query Objects* tool to retrieve information about the map objects by clicking on the map;
pt_pt: a ferramenta *Consulta de Objectos* para recuperar informações sobre os objectos do mapa clicando no mapa;

source: the *Print* tool to print the preview.
pt_pt: a ferramenta *Imprimir* para imprimir a pré-visualização.

source: *Map Preview*
pt_pt: *Pré-visualização do Mapa*

source: See the `MapStore Documentation <https://mapstore2.readthedocs.io/en/latest/>`_ to learn more.
pt_pt: Veja a `Documentação do MapStore <https://mapstore2.readthedocs.io/en/latest/>`_ para saber mais.

source: Tabs Sections
pt_pt: Secções de Guias

source: The *Map Information* page shows you some tabs sections containing different information about the map:
pt_pt: A página *Informações do Mapa* mostra algumas secções das guias contendo diferentes informações sobre o mapa:

source: The tab *Info* is active by default. This tab section shows some metadata such as its Title, the License, the Publication Date etc. The metadata also indicates the map owner and which regions are involved. The ``Map Layers WMS GetCapabilities document`` link is also provided.
pt_pt: A guia *Info* está activa por padrão. Esta secção da guia mostra alguns metadados como o Título, a Licença, a Data de Publicação, etc. Os metadados também indicam o proprietário do mapa e quais regiões estão envolvidas. O link ``Map Layers WMS GetCapabilities document`` também é fornecido.

source: *Maps Info tab*
pt_pt: *Guia de Informações dos Mapas*

source: The *Share* tab provides the links for the map to share through social media or email.
pt_pt: A guia *Share* fornece os links para o mapa compartilhar por meio da mídia social ou e-mail.

source: *Map Sharing*
pt_pt: *Compartilhamento de Mapa*

source: You can *Rate* the map through the *Rating system*.
pt_pt: Você pode *Classificar* o mapa através do *Sistema de classificação*.

source: *Map Rating*
pt_pt: *Classificação do Mapa*

source: In the *Comments* tab section you can post your comment. Click on :guilabel:`Add Comment`, insert your comment and click :guilabel:`Submit Comment` to post it.
pt_pt: Na secção da guia *Comments*, você pode postar seu comentário. Clique em :guilabel:`Add Comment`, insira seu comentário e clique em :guilabel:`Submit Comment` para postá-lo.

source: *Map Comments*
pt_pt: *Comentários do Mapa*

source: Your comment will be added next to the last already existing comment. If you want to remove it click on the red :guilabel:`Delete` button.
pt_pt: Seu comentário será adicionado ao lado do último comentário já existente. Se você deseja removê-lo, clique no botão vermelho :guilabel:`Delete`.

source: If you want this map in your *Favorites* (see :ref:`editing-profile`), open the *Favorite* tab and click on :guilabel:`Add to Favorites`.
pt_pt: Se deseja este mapa nos seus *Favoritos* (veja :ref:`editing-profile`), abra a aba *Favoritos* e clique em :guilabel:`Add to Favorites`.

source: *Your Favorite Maps*
pt_pt: *Seus Mapas Favoritos*

source: Map Tools
pt_pt: Ferramentas de Mapa

source: In the right side of the *Map Information* page there are some tools that can help you to manage your maps. In this paragraph you will learn how to discover and retrieve information about maps.
pt_pt: No lado direito da página *Informações do Mapa*, existem algumas ferramentas que podem ajudá-lo a gerir seus mapas. Neste parágrafo, irá aprender como descobrir e recuperar informações sobre mapas.

source: The following is a list of actions you can take in order to accomplish this task:
pt_pt: A seguir está uma lista de acções que pode tomar para completar esta tarefa:

source: click the :guilabel:`Download Map` button, to download the map as image;
pt_pt: clique no botão :guilabel:`Download Map`, para baixar o mapa como imagem;

source: click the :guilabel:`Metadata Detail` button to see the map metadata, see :ref:`map-metadata`;
pt_pt: clique no botão :guilabel:`Metadata Detail` para ver os metadados do mapa, consulte :ref:`map-metadata`;

source: click the :guilabel:`Editing Tools` button to access to many editing tools. Those functionalities will be explained in the :ref:`exploring-maps` section;
pt_pt: clique no botão :guilabel:`Editing Tools` para acessar muitas ferramentas de edição. Essas funcionalidades serão explicadas na secção :ref:`exploring-maps`;

source: click the :guilabel:`View Map` button to open the map, see the :ref:`exploring-maps` section for more details;
pt_pt: clique no botão :guilabel:`View Map` para abrir o mapa, veja a secção :ref:`exploring-maps` para mais detalhes;

source: see the *Map Layers* section to know which layers are used by the map (you can open the *Layer Page* by clicking on its name, available only for local layers);
pt_pt: veja a secção *Camadas do Mapa* para saber quais camadas são usadas pelo mapa (pode abrir a *Página de Camadas* clicando no seu nome, disponível apenas para camadas locais);

source: click the :guilabel:`Create a Map` button of the *Copy this map* section to duplicate the map;
pt_pt: clique no botão :guilabel:`Create a Map` da secção *Copiar este mapa* para duplicar o mapa;

source: click the :guilabel:`Publish Map WMS` of the *Map WMS* section to publish local map layers as WMS layer group;
pt_pt: clique em :guilabel:`Publish Map WMS` da secção *Mapa WMS* para publicar camadas de mapas locais como grupo de camadas WMS;

source: see the *About* section to know the map *Owner*, the *Contact* user and the *Metadata Author*.
pt_pt: consulte a secção *Sobre* para conhecer o *Proprietário* do mapa, o usuário de *Contacto* e o *Autor de Metadados*.
