Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/map_metadata.po
Languages: pt

source: Maps Metadata
pt: Metadados de Mapas

source: **Basic Metadata**
pt: **Metadados Básicos**

source: *Basic Map Metadata*
pt: *Metadados de Mapa Básicos*

source: In the first step the system asks you to insert the following metadata (required fields are highlighted with red outlines):
pt: Na primeira etapa, o sistema pede que insira os seguintes metadados (os campos obrigatórios são destacados com contornos vermelhos):

source: The *Thumbnail* of the map (click :guilabel:`Edit` to change it);
pt: A *Miniatura* do mapa (clique em :guilabel:`Edit` para alterá-lo);

source: The *Title* of the map, which should be clear and understandable;
pt: O *Título* do mapa, que deve ser claro e compreensível;

source: An *Abstract*; brief narrative summary of the content of the Map
pt: Um *Resumo*; breve resumo narrativo do conteúdo do Mapa

source: The *Abstract* panel allows you to insert HTML code through a *wysiwyg* text editor
pt: O painel *Resumo* permite inserir código HTML por meio de um editor de texto *wysiwyg*

source: The *Creation/Publication/Revision Dates* which define the time period that is covered by the map;
pt: As *Datas de Criação/Publicação/Revisão* que definem o período de tempo coberto pelo mapa;

source: The *Keywords*, which should be chosen within the available list;
pt: As *Palavras-Chave*, que devem ser escolhidas dentro da lista disponível;

source: The *Category* which the map belongs to;
pt: A *Categoria* à qual o mapa pertence;

source: The *Group* which the map is linked to.
pt: O *Grupo* ao qual o mapa está vinculado.

source: Click :guilabel:`Next >>` to go to the next step.
pt: Clique em :guilabel:`Next >>` para ir para a próxima etapa.

source: **Location and Licenses**
pt: **Localização e Licenças**

source: *Location and Licenses Metadata for Maps*
pt: *Localização e Metadados de Licenças para Mapas*

source: The following list shows what kinds of metadata you are required to enter (see also the picture below):
pt: A lista a seguir mostra quais tipos de metadados você deve inserir (veja também a imagem abaixo):

source: The *Language* of the layer;
pt: O *Idioma* da camada;

source: The *License* of the dataset;
pt: A *Licença* do conjunto de dados;

source: The *Regions* covered by the layers extent. Proposed extents cover the following scales: global, continental, regional, national;
pt: As *Regiões* cobertas pela extensão das camadas. As extensões propostas cobrem as seguintes escalas: global, continental, regional, nacional;

source: The *Data Quality statement* (general explanation of the data producer's knowledge about the lineage of a dataset);
pt: A *Declaração de Qualidade de Dados* (explicação geral do conhecimento do produtor de dados sobre a linhagem de um conjunto de dados);

source: Potential *Restrictions* on layer sharing.
pt: Potenciais *Restrições* no compartilhamento de camadas.

source: No further mandatory metadata are required in the next step so, once the required fields have been filled out, a green :guilabel:`Done` button will be visible in the screen. Click :guilabel:`Next >>` to go to the next step or :guilabel:`<< Back` to go back to the previous step.
pt: Nenhum outro metadado obrigatório é necessário na próxima etapa, então, uma vez que os campos necessários tenham sido preenchidos, um botão verde :guilabel:`Done` ficará visível na tela. Clique em :guilabel:`Next >>` para ir para a próxima etapa ou :guilabel:`<< Back` para voltar à etapa anterior.

source: **Optional Metadata**
pt: **Metadados Opcionais**

source: *Optional Map Metadata*
pt: *Metadados de Mapa Opcionais*

source: Complementary information are:
pt: As informações complementares são:

source: The *Edition* of the map;
pt: A *Edição* do mapa;

source: The *Purpose* of the map and its objectives;
pt: O *Propósito* do mapa e seus objectivos;

source: Any *Supplemental information* that can provide a better understanding of the map;
pt: Qualquer *Informação Suplementar* que possa fornecer uma melhor compreensão do mapa;

source: The *Maintenance frequency* of the map;
pt: A *Frequência de Manutenção* do mapa;

source: The *Spatial representation type*, the method used to represent geographic information in the dataset;
pt: O *Tipo de Representação Espacial*, o método usado para representar a informação geográfica no conjunto de dados;

source: The users who are *Responsible* for the layer, its *Owner*, and the *Author* of its metadata;
pt: Os usuários que são *Responsáveis* pela camada, seu *Proprietário* e o *Autor* de seus metadados;

source: If you miss some mandatory metadata the *Completeness* bar shows you a red message like the one in the picture below.
pt: Se alguns metadados obrigatórios escaparem, a barra *Completude* mostra uma mensagem em vermelho como a da imagem abaixo.

source: *Completeness Progress Bar*
pt: *Barra de Progresso de Completude*

source: Metadata Advanced Editing
pt: Edição Avançada de Metadados

source: *The Advanced Edit button*
pt: *O botão de Edição Avançada*
