Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/map_permissions.po
Languages: pt_pt

source: Changing the Map Permissions
pt_pt: Alterando as Permissões do Mapa

source: In the :ref:`map-info` section of this guide we said that you can see your maps and all the published maps. In GeoNode the permissions management system is indeed more complex. Administrators can choose who can do what for each map. Users can manage only the maps they own or the maps which they are authorize to manage.
pt_pt: Na secção :ref:`map-info` deste guia, dissemos que pode ver seus mapas e todos os mapas publicados. No GeoNode, o sistema de gestão de permissões é na realidade mais complexo. Os administradores podem escolher quem pode fazer o quê em cada mapa. Os utilizadores podem gerir apenas os mapas que possuem ou os mapas que estão autorizados a gerir.

source: By default only owners can edit and manage maps, anyone can view and download them.
pt_pt: Por padrão, apenas os proprietários podem editar e gerir mapas, qualquer pessoa pode visualizá-los e baixá-los.

source: In order to modify the *Map Permissions* settings you have to click the :guilabel:`Change the Layer Permissions` button in the *Map Page*.
pt_pt: Para modificar as configurações de *Permissões do Mapa*, deve clicar no botão :guilabel:`Change the Layer Permissions` na *Página do Mapa*.

source: *Change Map Permissions*
pt_pt: *Altere as Permissões do Mapa*

source: Through the *Permissions Settings Panel* you can add or remove permissions for users and groups. The picture below shows an example.
pt_pt: Através do *Painel de Configurações de Permissões*, pode adicionar ou remover permissões para utilizadores e grupos. A imagem em baixo mostra um exemplo.

source: *Map Permissions settings for users and groups*
pt_pt: *Configurações de Permissões do Mapa para utilizadores e grupos*

source: You can set the following types of permissions:
pt_pt: Pode definir os seguintes tipos de permissões:

source: *View* allows to view the map;
pt_pt: *Visualizar* permite ver o mapa;

source: *Download* allows to download the map;
pt_pt: *Download* permite descarregar o mapa;

source: *Change Metadata* allows to change the map metadata;
pt_pt: *Alterar Metadados* permite alterar os metadados do mapa;

source: *Manage* allows to update, delete, change permissions, publish and unpublish the map.
pt_pt: *Gerir* permite actualizar, excluir, alterar permissões, publicar e cancelar a publicação do mapa.

source: When assigning permissions to a group, all the group members will have those permissions. Be careful in case of editing permissions.
pt_pt: Ao atribuir permissões a um grupo, todos os membros do grupo terão essas permissões. Tenha cuidado ao editar permissões.

source: Click on :guilabel:`Apply Changes` to save these settings.
pt_pt: Clique em :guilabel:`Apply Changes` para guardar essas configurações.
