Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/exploring_maps/get_fetureinfo.po
Languages: pt_pt

source: Customizing The Layers' GetFeatureInfo Templates
pt_pt: Personalizando os Modelos GetFeatureInfo das Camadas

source: When “clicking” over a feature of a Layer into a GeoNode Map, an info window popups showing a formatted representation of the raw data identified by the coordinates (see Fig. 1)
pt_pt: Ao “clicar” sobre um recurso de uma camada em um mapa GeoNode, uma janela pop-up de informações mostra uma representação formatada dos dados brutos identificados pelas coordenadas (ver Fig. 1)

source: The way how such information is presented to the user is defined by what we call “GetFeatureInfo Template”. The latter is basically an HTML snippet containing some placeholders and special inline codes that instruct GeoServer on how to generate the raw data output.
pt_pt: A forma como essas informações são apresentadas ao usuário é definida pelo que chamamos de “Template GetFeatureInfo”. O último é basicamente um trecho de HTML contendo alguns marcadores de posição e códigos embutidos especiais que instruem o GeoServer sobre como gerar a saída de dados brutos.

source: The outcome is a rendered HTML snippet with the real values replacing the placeholders of the Template.
pt_pt: O resultado é um fragmento de HTML renderizado com os valores reais substituindo os espaços reservados do Modelo.

source: Currently, GeoNode allows a very simple mechanism to customize the “GetFeatureInfo Template” of a Layer.
pt_pt: Atualmente, o GeoNode permite um mecanismo muito simples para personalizar o “Template GetFeatureInfo” de uma camada.

source: It is possible, through the Layer Metadata Editor Wizard, to assign a name and a label to the attributes we want to display on the GetFeatureInfo output.
pt_pt: É possível, por meio do Assistente Editor de Metadados de Camada, atribuir um nome e um rótulo aos atributos que desejamos exibir na saída GetFeatureInfo.

source: Notice that the attributes without a label and name, in case others are present, won’t be rendered at all.
pt_pt: Observe que os atributos sem um rótulo e nome, no caso de outros estarem presentes, não serão renderizados.

source: As an instance, by using the example above, we can customize a bit the Layer Metadata as shown in Fig. 2
pt_pt: Como uma instância, usando o exemplo acima, podemos personalizar um pouco os Metadados da Camada, conforme mostrado na Fig. 2

source: The “GetFeatureInfo” output will change accordingly as shown in Fig. 3
pt_pt: A saída “GetFeatureInfo” mudará de acordo, conforme mostrado na Fig. 3

source: Simple Template: Assigning A Media-Type To Attribute Values
pt_pt: Modelo Simples: atribuindo um Tipo-de-Mídia a Valores de Atributo

source: The easiest way to render a different media-type (:guilabel:`image`, :guilabel:`audio`, :guilabel:`video` or :guilabel:`iframe`) to a property value, is to change it from the :guilabel:`Metadata Editor Wizard` attributes panel.
pt_pt: A maneira mais fácil de renderizar um tipo-de-mídia diferente (:guilabel: `imagem`, :guilabel:`audio`, :guilabel:`video` ou :guilabel:`iframe`) para um valor de propriedade, é alterá-lo do painel de atributos :guilabel:`Assistente do Editor de Metadados`.

source: By changing the :guilabel:`Display Type` of an attribute from this panel as shown in Fig. 4
pt_pt: Alterando o :guilabel:`Tipo de Exibição` de um atributo deste painel, conforme mostrado na Fig. 4

source: GeoNode will create automatically the HTML media type when rendering by using the **value** of the selected property.
pt_pt: O GeoNode criará automaticamente o tipo de mídia HTML ao renderizar usando o **valor** da propriedade selecionada.

source: So, as an example, if, in the figure above, the attribute ``NAME`` contains values representing some ``links`` to other resources, GeoNode will create those links automatically for you when clicking over a geometry.
pt_pt: Assim, a título de exemplo, se, na figura acima, o atributo ``NOME`` contém valores que representam alguns ``links`` para outros recursos, o GeoNode irá criar esses links automaticamente para você ao clicar sobre uma geometria.

source: Selecting :guilabel:`image` as media-type (Fig. 6)
pt_pt: Seleccionando :guilabel:`imagem` como tipo-de-mídia (Fig. 6)

source: and editing the contents accordingly (Fig. 7)
pt_pt: e editar o conteúdo de acordo (Fig. 7)

source: you will get a nice effect as shown in Fig. 8
pt_pt: você obterá um bom efeito, conforme mostrado na Fig. 8

source: Advanced Template: Use A Custom HTML Template
pt_pt: Modelo Avançado: Use um Modelo HTML Personalizado

source: By selecting the option :guilabel:`Use a custom template?` as shown in Fig. 9
pt_pt: Seleccionando a opção :guilabel:`Usar um modelo personalizado?` Como mostrado na Fig. 9

source: You will be able to provide your own custom HTML Template for the Feature Info output.
pt_pt: Você poderá fornecer seu próprio modelo HTML personalizado para a saída de informações do recurso.

source: The example below shows how it is possible to create a nice HTML output with an :guilabel:`image` taking the ``src`` from the attribute :guilabel:`NAME` values, through the use of the keyword ``${properties.NAME}``
pt_pt: O exemplo abaixo mostra como é possível criar uma boa saída HTML com uma :guilabel:`imagem` tomando o``src`` dos valores do atributo :guilabel:`NAME`, através do uso da palavra-chave ``${properties.NAME}``

source: Optional: Customizing the HTML WYSIWYG Editor Menu Bar
pt_pt: Opcional: Personalização da Barra de Menu do Editor HTML WYSIWYG

source: The :guilabel:`Menu Bar` and :guilabel:`Tool Bar` of the HTML Editor, can be easily customized by overriding the ``TINYMCE_DEFAULT_CONFIG`` variable on :guilabel:`settings.py` (see :ref:`tinyMCE Default Config Settings`)
pt_pt: O :guilabel:`Barra de Menu` e :guilabel:`Barra de Ferramentas` do Editor de HTML, pode ser facilmente personalizado substituindo a variável `` TINYMCE_DEFAULT_CONFIG`` em :guilabel:`settings.py` (veja :ref:`tinyMCE Definições de Configuração Padrão`)

source: There are many plugins and options allowing you to easily customize the editor and also provides some predefined *templates* to speed up the editing.
pt_pt: Existem muitos plug-ins e opções que permitem personalizar facilmente o editor e também fornece alguns *modelos* predefinidos para acelerar a edição.

source: For more information about the Javascript tool, please refer to https://www.tiny.cloud/
pt_pt: Para obter mais informações sobre a ferramenta Javascript, consulte https://www.tiny.cloud/
