Repository: GeoNode/documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/exploring_maps/index.po
Languages: pt_pt

source: Exploring Maps
pt_pt: Exploração de Mapas

source: From the :guilabel:`Explore Maps` link of the navigation bar you can reach the *Maps List* page (see :ref:`finding-maps`). Select a map you are interested in and click on it, the *Map Page* will open.
pt_pt: A partir do link :guilabel:`Explore Maps` da barra de navegação você pode acessar a página *Lista de Mapas* (veja :ref:`finding-maps`). Seleccione um mapa de seu interesse e clique nele, a *Página do Mapa* será aberta.

source: *The View Map button*
pt_pt: *O botão Exibir Mapa*

source: Click on the :guilabel:`View Map` button to open the *Map Viewer*.
pt_pt: Clique no botão :guilabel:`View Map` para abrir o *Visualizador de Mapas*.

source: *The Map View*
pt_pt: *A Visualização do Mapa*

source: The Map Viewer (based on `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_) provides the following tools:
pt_pt: O Visualizador de Mapas (baseado em `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_) fornece as seguintes ferramentas:

source: the :ref:`toc` to manage the map contents;
pt_pt: o :ref:`toc` para gerir o conteúdo do mapa;

source: the *Basemap Switcher* to change the basemap (see the next paragraphs);
pt_pt: o *Comutador de mapa Base* para mudar o mapa base (veja os próximos parágrafos);

source: the *Search Bar* to search by location, name and coordinates (see the paragraph below);
pt_pt: a *Barra de Pesquisa* para pesquisar por localização, nome e coordenadas (veja o parágrafo abaixo);

source: the :ref:`options-menu-tools` which contains the link to the *Print* tool, to the layers *Catalog* and to the *Measure* tool;
pt_pt: o :ref:`options-menu-tools` que contém o link para a ferramenta *Imprimir*, para as camadas *Catálogo* e para a ferramenta *Medir*;

source: the *Sidebar* and its tools such as the *Zoom* tools and the *Get Features Info* tool;
pt_pt: a *Barra lateral* e suas ferramentas, como as ferramentas *Zoom* e *Obter Informações sobre Recursos*;

source: the *Footer Tools* to manage the scale of the map, to track the mouse coordinates and change the CRS (Coordinates Reference System).
pt_pt: as *Ferramentas de Rodapé* para gerir a escala do mapa, rastrear as coordenadas do mouse e alterar o CRS (Sistema de Referência de Coordenadas).

source: Search Bar
pt_pt: Barra de Pesquisa

source: The *Search Bar* of the map viewer allows you to find point of interests (POIs), streets or locations by name.
pt_pt: A *Barra de Pesquisa* do visualizador do mapa permite que você encontre pontos de interesse (POIs), ruas ou locais por nome.

source: Lets type the name of some place then select the first record.
pt_pt: Vamos digitar o nome de algum lugar e seleccionar o primeiro registro.

source: *The Search Bar*
pt_pt: *A barra de Pesquisa*

source: The map will automatically re-center on that area delimiting it by a polygon in the case of an area, by a line in the case of a linear shape (e.g. streets, streams) and by a marker in the case of a point.
pt_pt: O mapa será automaticamente centralizado nessa área, delimitando-a por um polígono no caso de uma área, por uma linha no caso de uma forma linear (por exemplo, ruas, riachos) e por um marcador no caso de um ponto.

source: *Result of a Search*
pt_pt: *Resultado de uma Pesquisa*

source: Sidebar Tools
pt_pt: Ferramentas da Barra Lateral

source: The *Map Viewer* makes also available the *Sidebar*. It is a navigation panel containing various tools that help you to explore the map such as tools for zooming, changing the extent and querying objects on the map.
pt_pt: O *Visualizador de Mapas* disponibiliza também a *Barra Lateral*. É um painel de navegação que contém várias ferramentas que o ajudam a explorar o mapa, como ferramentas de zoom, alteração de extensão e consulta de objectos no mapa.

source: By default the *Sidebar* shows you the zooming buttons |zoom_in_button| and |zoom_out_button|, other options can be explored by clicking on |sidebar_expand_button| which expands/collapses the toolbar.
pt_pt: Por padrão, a *Barra Lateral* mostra os botões de zoom |zoom_in_button| e |zoom_out_button|, outras opções podem ser exploradas clicando em |sidebar_expand_button| que expande/colapsa a barra de ferramentas.

source: *The Default Sidebar*
pt_pt: *A Barra lateral Padrão*

source: *The Expanded Sidebar*
pt_pt: *A Barra lateral Expandida*

source: The *Sidebar* contains the following tools:
pt_pt: A *Barra lateral* contém as seguintes ferramentas:

source: The *Query Objects on map* allows you to get feature information through the |query_objects_on_map_button| button. It allows you to retrieve information about the features of some layers by clicking them directly on the map.
pt_pt: A *Consulta de Objectos no Mapa* permite que você obtenha informações de características através do botão |query_objects_on_map_button| . Ele permite que você recupere informações sobre os recursos de algumas camadas clicando nelas diretamente no mapa.

source: *Querying Objects on map*
pt_pt: *Consultando Objectos no mapa*

source: When clicking on map a new panel opens. That panel will show you all the information about the clicked features for each active loaded layer.
pt_pt: Ao clicar no mapa, um novo painel é aberto. Esse painel mostrará todas as informações sobre os recursos clicados para cada camada activa carregada.

source: You can *Zoom To Max Extent* by clicking |zoom_to_max_extent_button|.
pt_pt: Você pode fazer *Zoom na Extensão Máxima* clicando em |zoom_to_max_extent_button|.

source: You can switch between the previous and the next zoom level through the *Go Back* button |go_back_button| and the *Go Forward* one |go_forward_button|.
pt_pt: Você pode alternar entre o nível de zoom anterior e o próximo por meio do botão *Voltar* |go_back_button| e o *Avançar* |go_forward_button|.

source: The *Switch to Full Screen* |full_screen_button| button allows to have a full screen map.
pt_pt: O botão *Mudar para Tela Inteira* |full_screen_button| permite ter um mapa em tela cheia.

source: Basemap Switcher
pt_pt: Comutador de Mapa base

source: By default, GeoNode allows to enrich maps with many world backgrounds:
pt_pt: Por padrão, o GeoNode permite enriquecer mapas com muitos fundos do tipo mundo:

source: *The Basemap Switcher Tool*
pt_pt: *A Ferramenta Basemap Switcher*

source: You can also decide to have an *Empty Background*.
pt_pt: Você pode, também, decidir ter um *Fundo vazio*.

source: *Switching the Basemap*
pt_pt: *Mudando o Mapa Base*

source: Footer Tools
pt_pt: Ferramentas de Rodapé

source: At the bottom of the map, the *Footer* shows you the *Scale* of the map and allows you to change it.
pt_pt: Na parte inferior do mapa, o *Rodapé* mostra a *Escala* do mapa e permite que você a altere.

source: *The Map Scale*
pt_pt: *A Escala do Mapa*

source: The |show_hide_coordinates_button| button allows you to see the pointer *Coordinates* and to change the Coordinates Reference System (CRS), WGS 84 by default.
pt_pt: O botão |show_hide_coordinates_button| permite que veja o ponteiro *Coordenadas* e altere o Sistema de Referência de Coordenadas (CRS), WGS 84 por padrão.

source: *The Pointer Coordinates and the CRS*
pt_pt: *As Coordenadas do Ponteiro e o CRS *
